nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/******************************************************************************

 @file  mac_hl_patch.c

 @brief This file implements high level mac patches.

 Group: WCS, LPC
 Target Device: cc13xx_cc26xx

 ******************************************************************************
 
 Copyright (c) 2015-2021, Texas Instruments Incorporated
 All rights reserved.

 IMPORTANT: Your use of this Software is limited to those specific rights
 granted under the terms of a software license agreement between the user
 who downloaded the software, his/her employer (which must be your employer)
 and Texas Instruments Incorporated (the "License"). You may not use this
 Software unless you agree to abide by the terms of the License. The License
 limits your use, and you acknowledge, that the Software may not be modified,
 copied or distributed unless embedded on a Texas Instruments microcontroller
 or used solely and exclusively in conjunction with a Texas Instruments radio
 frequency transceiver, which is integrated into your product. Other than for
 the foregoing purpose, you may not use, reproduce, copy, prepare derivative
 works of, modify, distribute, perform, display or sell this Software and/or
 its documentation for any purpose.

 YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
 PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
 INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
 NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
 TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
 NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
 LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
 INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
 OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
 OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
 (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

 Should you have any questions regarding your right to use this Software,
 contact Texas Instruments Incorporated at www.TI.com.

 ******************************************************************************
 
 
 *****************************************************************************/


/*-------------------------------------------------------------------------------------------------
*           Include
*--------------------------------------------------------------------------------------------------
*/

#ifndef LIBRARY
#include "ti_wisunfan_features.h"
#endif

#include <crypto_mac_api.h>
#include "timac_api.h"
#include "mac_pib.h"
#include "mac_hl_patch.h"
#include "rom_jt_154.h"
#include "dbg.h"
#include "mac_tx.h"
#include "mac_assert.h"
#include "mac_ie_build.h"
#include "mac_tx.h"
#include "mac_radio_defs.h"
#include "mac_ie_parse.h"

#ifdef FEATURE_WISUN_SUPPORT
#include "api_mac.h"
#endif

#ifdef FH_HOP_DEBUG
#include "fh_data.h"
#include "ns_trace.h"
#define TRACE_GROUP "mhp"
#endif

#ifdef FEATURE_EDFE_TEST_MODE
uint8_t switchToEDFE = 0;
#endif

/*-------------------------------------------------------------------------------------------------
*           Constants
*--------------------------------------------------------------------------------------------------
*/
#define AESCCM_FIELDLEN     2
#define AESCCM_NONCELEN     13

/* Value to determine last channel for end of scan */
#define MAC_SCAN_CHAN_END               (MAC_CHAN_HIGHEST + 1)

/* Value indicating scanning has not started */
#define MAC_SCAN_CHAN_INIT              (MAC_SCAN_CHAN_END + 1)

/* Multiplex ID for Key Management Protocol */
#define MPX_ID_KMP                      0x0001
/* ------------------------------------------------------------------------------------------------
 *                                           Global Variables
 * ------------------------------------------------------------------------------------------------
 */
#ifdef FEATURE_SECURE_COMMISSIONING
bool IsNetworkKey = false;
#endif

#if defined(TIMAC_ROM_PATCH)
#define SECURITY_LEVEL_PASSED(SEC1, SEC2) ((SEC1 >> 2) >= (SEC2 >> 2)) && ((SEC1 & 0x03) >= (SEC2 & 0x03))

#define MACWRAPPER_INVALID_KEY_INDEX        0

/* Energy detect scan resolution in MS */
#define MAC_ED_SCAN_RESOLUTION (1)

/* Convert clockDuration in milliseconds to ticks. */
#define ED_SCAN_RESOLUTION_CLOCK_TICKS  (MAC_ED_SCAN_RESOLUTION * (1000 / Clock_tickPeriod))

OsalPort_TimerID pClockHandleEDScan;

extern macRx_t  *pRxBuf;
/* ------------------------------------------------------------------------------------------------
 *                                           Local Functions
 * ------------------------------------------------------------------------------------------------
 */
int8 macWrapper8ByteUnused(const uint8 *extaddr);
uint8 macDeviceDescriptorLookup( deviceDescriptor_t *deviceDescriptor,
                                 uint8 *deviceLookupData,
                                 uint8 deviceLookupSize );
uint8 macIncomingKeyUsagePolicyChecking( keyDescriptor_t *keyDescriptor,
                                         uint8 frameType,
                                         uint8 cmdFrameId );
uint8 macIncomingSecurityLevelChecking( uint8 securityLevel,
                                        uint8 frameType,
                                        uint8 cmdFrameId );
uint8 macBlacklistChecking( keyDescriptor_t *pKeyDescriptor,
                            uint8 *deviceLookupData,
                            uint8 deviceLookupSize,
                            deviceDescriptor_t **ppDeviceDescriptor,
                            keyDeviceDescriptor_t **ppKeyDeviceDescriptor );
uint8 macIncomingFrameSecurityMaterialRetrieval( macRx_t *pMsg,
                                                 keyDescriptor_t **ppKeyDescriptor,
                                                 deviceDescriptor_t **ppDeviceDescriptor,
                                                 keyDeviceDescriptor_t **ppKeyDeviceDescriptor);
uint8 macCcmStarInverseTransform( uint8    *pKey,
                                  uint32   frameCounter,
                                  uint8    securityLevel,
                                  uint8    *pAData,
                                  uint16   aDataLen,
                                  uint8    *pCData,
                                  uint16   cDataLen,
                                  uint8    *pExtAddr );
uint8 macKeyDescriptorLookup( uint8 *pLookupData, uint8 lookupDataSize, keyDescriptor_t **ppKeyDescriptor );
keyDescriptor_t* macOutgoingFrameKeyDescRetrieval( ApiMac_sec_t  *pSec,
                                                   sAddr_t  *pDstAddr,
                                                   uint16   dstPanId );
extern uint32 macRadioTxBOBoundary(void);
#endif

/*-------------------------------------------------------------------------------------------------
*           Functions
*--------------------------------------------------------------------------------------------------
*/

