nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/**************************************************************************************************
 * @fn          macCheckPhyRate
 *
 * @brief       This function returns predefined phy rate.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      PHY rate (PHY_MODE_FSK_50K, PHY_MODE_FSK_200K, PHY_MODE_SLR_5K, PHY_MODE_UNDEF)
 **************************************************************************************************
 */
uint8 macCheckPhyRate(uint8 phyID)
{
    /*SLR 5Kbps */
    if ((phyID >= MAC_5KBPS_915MHZ_PHY_129)
     && (phyID <= MAC_5KBPS_868MHZ_PHY_131))
    {
        return PHY_MODE_SLR_5K;
    }

    /* FSK 50Kbps */
    if (phyID == APIMAC_50KBPS_1a || phyID == APIMAC_50KBPS_1b)
    {
        return PHY_MODE_FSK_50K;
    }

    /* FSK 100Kbps */
    if (phyID == APIMAC_100KBPS_2a || phyID == APIMAC_100KBPS_2b)
    {
        return PHY_MODE_FSK_100K;
    }

    /* FSK 150Kbps */
    if (phyID == APIMAC_150KBPS_3)
    {
        return PHY_MODE_FSK_150K;
    }

    /* FSK 200kbps */
    if(phyID == APIMAC_200KBPS_4a || phyID == APIMAC_200KBPS_4b)
    {
        return PHY_MODE_FSK_200K;
    }

    /* FSK 200Kbps */
    if ((phyID >= MAC_200KBPS_915MHZ_PHY_132)
     && (phyID <= MAC_200KBPS_868MHZ_PHY_133))
    {
        return PHY_MODE_FSK_200K;
    }

    if(phyID == APIMAC_300KBPS_5)
    {
        return PHY_MODE_FSK_300K;
    }

    return PHY_MODE_UNDEF;
}

/**************************************************************************************************
 * @fn          macCheckPhyMode
 *
 * @brief       This function returns predefined phy mode.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      PHY mode (PHY_MODE_STD, PHY_MODE_GEN, PHY_MODE_UNDEF)
 **************************************************************************************************
 */
uint8 macCheckPhyMode(uint8 phyID)
{
    /*Generic Phy Mode */
    if ((phyID >= MAC_MRFSK_STD_PHY_ID_BEGIN)
     && (phyID <= MAC_MRFSK_STD_PHY_ID_END))
    {
        return PHY_MODE_STD;
    }

    /* Standard Phy Mode */
    if ((phyID >= MAC_MRFSK_GENERIC_PHY_ID_BEGIN)
     && (phyID <= MAC_MRFSK_GENERIC_PHY_ID_END))
    {
        return PHY_MODE_GEN;
    }

    return PHY_MODE_UNDEF;
}

/**************************************************************************************************
 * @fn          macPibIndex
 *
 * @brief       This function takes an PIB attribute and returns the index in to
 *              macPibTbl for the attribute.
 *
 * input parameters
 *
 * @param       pibAttribute - PIB attribute to look up.
 *
 * output parameters
 *
 * None.
 *
 * @return      Index in to macPibTbl for the attribute or MAC_PIB_INVALID.
 **************************************************************************************************
 */
uint8 macPibIndex(uint8 pibAttribute)
{
  if ((pibAttribute >= MAC_ATTR_SET1_START) && (pibAttribute <= MAC_ATTR_SET1_END))
  {
    return (pibAttribute - MAC_ATTR_SET1_START + MAC_ATTR_SET1_OFFSET);
  }
  else if ((pibAttribute >= MAC_ATTR_SET2_START) && (pibAttribute <= MAC_ATTR_SET2_END))
  {
    return (pibAttribute - MAC_ATTR_SET2_START + MAC_ATTR_SET2_OFFSET);
  }
  else
  {
    return MAC_PIB_INVALID;
  }
}

/**************************************************************************************************
 * @fn          macPibCheckByPatch
 *
 * @brief       This function check some condition to apply this pib.
 *
 * input parameters
 *
 * @param       pibAttribute - The attribute identifier.
 * @param       pValue - pointer to the attribute value.
 *
 * output parameters
 *
 * None.
 *
 * @return      The status of the request, as follows:
 *              MAC_PIB_PATCH_NONE existing pib.
 *              MAC_PIB_PATCH_DONE no need to patch for new pib.
 *              MAC_PIB_PATCH_MORE more patch at the next step for new patch.
 *
 **************************************************************************************************
 */
uint8 macPibCheckByPatch(uint8 pibAttribute, void *pValue)
{
    (void) pibAttribute;
    (void) pValue;

    return MAC_PIB_PATCH_NONE;
}

/**************************************************************************************************
 * @fn          macSetDefaultsByPatch
 *
 * @brief       This function sets proper changes depending on the pib attribute.
 *
 * input parameters
 *
 * @param       pibAttribute - The attribute identifier.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macSetDefaultsByPatch(uint8 pibAttribute)
{
#if defined(DeviceFamily_CC13X2) || defined(DeviceFamily_CC13X2X7)
    int8 power = MAC_DEFAULT_TX_POWER;

    if (pibAttribute == MAC_RF_PA_TYPE)
    {
        if (pMacPib->paType)
        {
          power = MAC_HPA_DEFAULT_TX_POWER;
          /* change power to default values */
          if (pMacPib->phyTransmitPower != power)
          {
            MAP_MAC_MlmeSetReq(MAC_PHY_TRANSMIT_POWER_SIGNED, &power);
          }
        }
        else
        {
          if (pMacPib->phyTransmitPower != power)
          {
            MAP_MAC_MlmeSetReq(MAC_PHY_TRANSMIT_POWER_SIGNED, &power);
          }
        }
        MAP_MAC_ResumeReq();
    }
#else
    (void) pibAttribute;
#endif
    return;
}

/**************************************************************************************************
 * @fn          macCcmEncrypt
 *
 * @brief       This function encrypt the packet by AES CCM.
 *
 * input parameters
 *
 * @param       trans - AES CCM transaction pointer.
 *
 * output parameters
 *
 * None.
 *
 * @return      The status of the operation, as follows:
 *
 **************************************************************************************************
 */
uint8 macCcmEncrypt(AESCCM_Transaction *trans)
{
    uint8 status;
#if !defined(DeviceFamily_CC13X2) && !defined(DeviceFamily_CC26X2) && !defined(DeviceFamily_CC13X2X7)
    int32 statusCrypto;
    CryptoCC26XX_KeyLocation keyLocation = CRYPTOCC26XX_KEY_0;

    /* Initialize AES key */
    statusCrypto = CryptoCC26XX_allocateKey(Crypto_handle, keyLocation,
                                            (uint32_t *) trans->pKey);

    if (statusCrypto != CRYPTOCC26XX_STATUS_ERROR)
    {
      CryptoCC26XX_AESCCM_Transaction transaction;

      /* run it through the authentication + encryption, pass the ccmLVal = 2 */

