nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
      transaction.opType = (trans->securityLevel >= MAC_SEC_LEVEL_ENC) ?
                           CRYPTOCC26XX_OP_AES_CCM :
                           CRYPTOCC26XX_OP_AES_CCM_NOCRYPT;
      transaction.mode = CRYPTOCC26XX_MODE_POLLING;
      transaction.keyIndex = keyLocation;
      transaction.authLength = trans->micLength;
      transaction.nonce = (char *)trans->nonce;
      transaction.msgIn = (char *)trans->data;
      transaction.header = (char *)trans->header;
      transaction.msgOut = trans->mic;
      transaction.fieldLength = AESCCM_FIELDLEN;
      transaction.msgInLength = trans->dataLength;
      transaction.headerLength = trans->headerLength;

      statusCrypto = CryptoCC26XX_transactPolling(Crypto_handle,
                                     (CryptoCC26XX_Transaction *) &transaction);

      CryptoCC26XX_releaseKey(Crypto_handle, (int *)&keyLocation);
    }

    status = (statusCrypto == CRYPTOCC26XX_STATUS_SUCCESS) ?
             MAC_SUCCESS : MAC_SECURITY_ERROR;
#else
    int_fast16_t statusCrypto;
    CryptoKey cryptoKey;
    halIntState_t cs;

    HAL_ENTER_CRITICAL_SECTION(cs);

    /* Initialize AES key */
    statusCrypto = CryptoKeyPlaintext_initKey(&cryptoKey, (uint8_t*) trans->pKey, MAC_KEY_MAX_LEN);

    if (statusCrypto == AESCCM_STATUS_SUCCESS)
    {
        AESCCM_Operation operationOneStepEncrypt;

        /* run it through the authentication + encryption, pass the ccmLVal = 2 */

        AESCCM_Operation_init(&operationOneStepEncrypt);
        operationOneStepEncrypt.key            = &cryptoKey;
        operationOneStepEncrypt.aad            = trans->header;
        operationOneStepEncrypt.aadLength      = trans->headerLength;
        operationOneStepEncrypt.input          = trans->data;
        operationOneStepEncrypt.output         = trans->data;
        operationOneStepEncrypt.inputLength    = trans->dataLength;
        operationOneStepEncrypt.nonce          = trans->nonce;
        operationOneStepEncrypt.nonceLength    = AESCCM_NONCELEN;
        operationOneStepEncrypt.mac            = trans->mic;
        operationOneStepEncrypt.macLength      = trans->micLength;

        statusCrypto = AESCCM_oneStepEncrypt(AESCCM_handle, &operationOneStepEncrypt);
    }

    HAL_EXIT_CRITICAL_SECTION(cs);

    status = (statusCrypto == AESCCM_STATUS_SUCCESS) ?
             MAC_SUCCESS : MAC_SECURITY_ERROR;
#endif
    return(status);

}

/**************************************************************************************************
 * @fn          macCcmDecrypt
 *
 * @brief       This function decrypt the packet by AES CCM.
 *
 * input parameters
 *
 * @param       trans - AES CCM transaction pointer.
 *
 * output parameters
 *
 * None.
 *
 * @return      The status of the operation, as follows:
 *
 **************************************************************************************************
 */
uint8 macCcmDecrypt(AESCCM_Transaction *trans)
{
    uint8 status;
#if !defined(DeviceFamily_CC13X2) && !defined(DeviceFamily_CC26X2) && !defined(DeviceFamily_CC13X2X7)
    int32 statusCrypto;
    CryptoCC26XX_KeyLocation keyLocation = CRYPTOCC26XX_KEY_0;

    /* Initialize AES key */
    statusCrypto = CryptoCC26XX_allocateKey(Crypto_handle, keyLocation,
                                        (uint32_t *) trans->pKey);

    if (statusCrypto != CRYPTOCC26XX_STATUS_ERROR)
    {
      CryptoCC26XX_AESCCM_Transaction transaction;

      /* run it through the authentication + encryption, pass the ccmLVal = 2 */

      transaction.opType = (trans->securityLevel >= MAC_SEC_LEVEL_ENC) ?
                           CRYPTOCC26XX_OP_AES_CCMINV :
                           CRYPTOCC26XX_OP_AES_CCMINV_NOCRYPT;
      transaction.mode = CRYPTOCC26XX_MODE_POLLING;
      transaction.keyIndex = keyLocation;
      transaction.authLength = trans->micLength;
      transaction.nonce = (char *)trans->nonce;
      transaction.msgIn = (char *)trans->data;
      transaction.header = (char *)trans->header;
      transaction.msgOut = trans->mic;
      transaction.fieldLength = AESCCM_FIELDLEN;
      transaction.msgInLength = trans->dataLength;
      transaction.headerLength = trans->headerLength;

      statusCrypto = CryptoCC26XX_transactPolling(Crypto_handle,
                                      (CryptoCC26XX_Transaction *) &transaction);

      CryptoCC26XX_releaseKey(Crypto_handle, (int *)&keyLocation);
    }

    status = (statusCrypto == CRYPTOCC26XX_STATUS_SUCCESS) ?
             MAC_SUCCESS : MAC_SECURITY_ERROR;
#else
    int_fast16_t statusCrypto;
    CryptoKey cryptoKey;
    halIntState_t  cs;

    HAL_ENTER_CRITICAL_SECTION(cs);

    /* Initialize AES key */
    statusCrypto = CryptoKeyPlaintext_initKey(&cryptoKey, (uint8_t*) trans->pKey, MAC_KEY_MAX_LEN);

    if (statusCrypto == AESCCM_STATUS_SUCCESS)
    {
      AESCCM_Operation operationOneStepDecrypt;

      /* run it through the authentication + encryption, pass the ccmLVal = 2 */

      AESCCM_Operation_init(&operationOneStepDecrypt);
      operationOneStepDecrypt.key            = &cryptoKey;
      operationOneStepDecrypt.aad            = trans->header;
      operationOneStepDecrypt.aadLength      = trans->headerLength;
      operationOneStepDecrypt.input          = trans->data;
      operationOneStepDecrypt.output         = trans->data;
      operationOneStepDecrypt.inputLength    = trans->dataLength - trans->micLength;
      operationOneStepDecrypt.nonce          = trans->nonce;
      operationOneStepDecrypt.nonceLength    = AESCCM_NONCELEN;
      operationOneStepDecrypt.mac            = trans->data + (trans->dataLength - trans->micLength);
      operationOneStepDecrypt.macLength      = trans->micLength;

      statusCrypto = AESCCM_oneStepDecrypt(AESCCM_handle, &operationOneStepDecrypt);
    }

    HAL_EXIT_CRITICAL_SECTION(cs);

    status = (statusCrypto == AESCCM_STATUS_SUCCESS) ?
             MAC_SUCCESS : MAC_SECURITY_ERROR;
#endif
    return(status);
}

#if defined(TIMAC_ROM_PATCH)
int8 macWrapper8ByteUnused(const uint8 *extaddr)
{
  int8 k;

  for (k = 0; k < 8; k++)
  {
    if (extaddr[k] != 0xff)
    {
      return 0;
    }
  }
  return 1;
}

