nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/**************************************************************************************************
 * @fn          macIncomingSecurityLevelChecking
 *
 * @brief       The inputs to this procedure are the incoming security level, the frame type and
 *              the command frame identifier. The output from this procedure is a passed, failed,
 *              or "conditionally passed" status.
 *
 * input parameters
 *
 * @param       securityLevel - incoming frame security level
 * @param       frameType - MAC frame type
 * @param       cmdFrameId - Command frame Identifier
 *
 * output parameters
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
uint8 macIncomingSecurityLevelChecking( uint8 securityLevel,
                                        uint8 frameType,
                                        uint8 cmdFrameId )
{
#ifdef FEATURE_MAC_SECURITY
  uint8                     i;
  uint8                     securityLevelTableEntries;
  securityLevelDescriptor_t *pSecLevelTbl;

  MAP_MAC_MlmeGetPointerSecurityReq( MAC_SECURITY_LEVEL_TABLE, (void **)&pSecLevelTbl);
  MAP_MAC_MlmeGetSecurityReq(MAC_SECURITY_LEVEL_TABLE_ENTRIES, &securityLevelTableEntries);

  for (i = 0; i < securityLevelTableEntries; i++)
  {
    if ((securityLevel == pSecLevelTbl->securityMinimum) && (frameType == pSecLevelTbl->frameType))
    {
        return (MAC_SUCCESS);
    }
    pSecLevelTbl++;
  }
#endif /*FEATURE_MAC_SECURITY*/
  return (MAC_IMPROPER_SECURITY_LEVEL);
 }

/**************************************************************************************************
 * @fn          macIncomingKeyUsagePolicyChecking
 *
 * @brief       The inputs to this procedure are the KeyDescriptor, the frame type, and the command
 *              frame identifier. The output from this procedure is a passed or failed status.
 *
 * input parameters
 *
 * @param       keyDescriptor - pointer to keyDescriptor_t
 * @param       frameType - Frame Type
 * @param       cmdFrameId - Command Frame Identifier
 *
 * output parameters
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
uint8 macIncomingKeyUsagePolicyChecking( keyDescriptor_t *keyDescriptor,
                                         uint8 frameType,
                                         uint8 cmdFrameId )
{
#ifdef FEATURE_MAC_SECURITY
  uint8                i;
  keyUsageDescriptor_t *pKeyUsageList;

  for (i = 0; i < keyDescriptor->keyUsageListEntries; i++)
  {
    pKeyUsageList = keyDescriptor->keyUsageList + i;

    if (frameType == pKeyUsageList->frameType)
    {
      return (MAC_SUCCESS);
    }
  }
#endif /*FEATURE_MAC_SECURITY*/
  return (MAC_IMPROPER_KEY_TYPE);

}

/**************************************************************************************************
 * @fn          macDeviceDescriptorLookup
 *
 * @brief       The inputs to this procedure are the DeviceDescriptor, the device lookup data, and
 *              the device lookup size. The output from this procedure is a passed or failed status.
 *
 * input parameters
 *
 * @param       deviceDescriptor - pointer to deviceDescriptor_t
 * @param       deviceLookupData - pointer to uint8
 * @param       deviceLookupSize - divice lookup size (4 or 8)
 *
 * output parameters
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
uint8 macDeviceDescriptorLookup( deviceDescriptor_t *deviceDescriptor,
                                 uint8 *deviceLookupData,
                                 uint8 deviceLookupSize )
{
#ifdef FEATURE_MAC_SECURITY
  if (deviceLookupSize == MAC_DEVICE_LOOKUP_LONG_LEN)
  {
    if (MAP_sAddrExtCmp(deviceLookupData, deviceDescriptor->extAddress) == TRUE)
    {
      return (MAC_SUCCESS);
    }
  }
#endif /*#ifdef FEATURE_MAC_SECURITY*/
  return (MAC_UNAVAILABLE_KEY);

}

/**************************************************************************************************
 * @fn          macApiStartReq
 *
 * @brief       This action function handles an API start request event.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macApiStartReq(macEvent_t *pEvent)
{
  uint8   status;

  if((pEvent->hdr.status  != MAC_UNAVAILABLE_KEY) &&
       (pEvent->hdr.status  != MAC_UNSUPPORTED_SECURITY) &&
       (pEvent->hdr.status  != MAC_INVALID_PARAMETER) &&
       (pEvent->hdr.status  != MAC_COUNTER_ERROR))
  {
    /* parameter check */
    status = MAP_macStartBegin(pEvent);
    pEvent->hdr.status = status;
  }

  MAP_macStartContinue(pEvent);
}

/**************************************************************************************************
 * @fn          macKeyDescriptorLookup
 *
 * @brief       The inputs to this procedure are the key lookup data and the key lookup size. The
 *              outputs from this procedure are a passed or failed status and, if passed, a
 *              KeyDescriptor.
 *
 * input parameters
 *
 * @param       pLookupData - keyIdLookupDescriptor - pointer to keyIdLookupDescriptor_t
 * @param       lookupDataSize - key lookup data size
 *
 * output parameters
 *
 * @param       ppKeyDescriptor - pointer to pointer to keyDescriptor_t
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
uint8 macKeyDescriptorLookup( uint8 *pLookupData, uint8 lookupDataSize, keyDescriptor_t **ppKeyDescriptor )
{
#ifdef FEATURE_MAC_SECURITY
  keyIdLookupDescriptor_t *pKeyIdLookupList;
  uint16_t i, j;
  uint16_t  keyTableEntries;

