nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
  MAP_MAC_MlmeGetPointerSecurityReq(MAC_KEY_TABLE, (void **)ppKeyDescriptor);
#ifndef FEATURE_WISUN_SUPPORT
  MAP_MAC_MlmeGetSecurityReq(MAC_KEY_TABLE_ENTRIES, &keyTableEntries);

  for (i = 0; i < keyTableEntries; i++)
#else
  for (i = 0; i < MAX_KEY_TABLE_ENTRIES; i++)
#endif
  {
    pKeyIdLookupList = (*ppKeyDescriptor)->keyIdLookupList;
    for (j = 0; j < (*ppKeyDescriptor)->keyIdLookupEntries; j++)
    {
      if (MAP_osal_memcmp(pKeyIdLookupList->lookupData, pLookupData, lookupDataSize) == TRUE )
      {
          return(MAC_SUCCESS);
      }
      /* to the next key ID look up list */
      pKeyIdLookupList++;
    }
    /* to the next PIB entry */
    (*ppKeyDescriptor)++;
  }
#endif /*FEATURE_MAC_SECURITY*/

  return (MAC_UNAVAILABLE_KEY);
}

/**************************************************************************************************
 * @fn          macBlacklistChecking
 *
 * @brief       The inputs to this procedure are the KeyDescriptor, the device lookup data, and the
 *              device lookup size. The outputs from this procedure are a passed or failed status
 *              and, if passed, a DeviceDescriptor and a KeyDeviceDescriptor.
 *
 * input parameters
 *
 * @param       keyDescriptor - pointer to keyDescriptor_t
 * @param       deviceLookupData - pointer to uint8
 * @param       deviceLookupSize - divice lookup size (4 or 8)
 *
 * output parameters
 *
 * @param       ppDeviceDescriptor - pointer to pointer to deviceDescriptor_t
 * @param       ppKeyDeviceDescriptor - pointer to pointer to keyDeviceDescriptor_t
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
uint8 macBlacklistChecking( keyDescriptor_t *pKeyDescriptor,
                            uint8 *deviceLookupData,
                            uint8 deviceLookupSize,
                            deviceDescriptor_t **ppDeviceDescriptor,
                            keyDeviceDescriptor_t **ppKeyDeviceDescriptor )
{
#ifdef FEATURE_MAC_SECURITY
  uint16_t i, deviceTableEntries;
  uint16_t deviceHandle;

  MAP_MAC_MlmeGetSecurityReq(MAC_DEVICE_TABLE_ENTRIES, &deviceTableEntries);

  /* search device */
  MAP_MAC_MlmeGetPointerSecurityReq( MAC_DEVICE_TABLE, (void **)ppDeviceDescriptor);
  for(i = 0; i < deviceTableEntries; i++)
  {
      *ppDeviceDescriptor += i;
      if (!MAP_macDeviceDescriptorLookup(*ppDeviceDescriptor, deviceLookupData, deviceLookupSize))
      {
        deviceHandle = i;
        break;
      }
  }

  /* not found device */
  if(i == deviceTableEntries)
  {
      return (MAC_UNSUPPORTED);
  }

  /* search key device */
  for(i = 0; i < pKeyDescriptor->keyDeviceListEntries; i++)
  {
      *ppKeyDeviceDescriptor = pKeyDescriptor->keyDeviceList + i;
      if((*ppKeyDeviceDescriptor)->deviceDescriptorHandle == deviceHandle)
      {
          break;
      }
  }

  /* add key device if not found key device */
  if(i == pKeyDescriptor->keyDeviceListEntries)
  {
      *ppKeyDeviceDescriptor = pKeyDescriptor->keyDeviceList + i;
      (*ppKeyDeviceDescriptor)->deviceDescriptorHandle = deviceHandle;
      (*ppKeyDeviceDescriptor)->uniqueDevice = false;
      (*ppKeyDeviceDescriptor)->blackListed = false;
      pKeyDescriptor->keyDeviceListEntries++;
  }

  if((*ppKeyDeviceDescriptor)->blackListed)
  {
      return (MAC_UNAVAILABLE_KEY);
  }
#endif /*FEATURE_MAC_SECURITY*/

  return(MAC_SUCCESS);
}

/**************************************************************************************************
 * @fn          macIncomingFrameSecurityMaterialRetrieval
 *
 * @brief       The input to this procedure is the frame to be unsecured. The outputs from this
 *              procedure are a passed or failed status and, if passed, a KeyDescriptor, a
 *              DeviceDescriptor, and a KeyDeviceDescriptor.
 *
 * input parameters
 *
 * @param       pMsg - pointer to the frame to be unsecured
 *
 * output parameters
 *
 * @param       ppKeyDescriptor - pointer to pointer to keyDescriptor_t
 * @param       ppDeviceDescriptor - pointer to pointer to deviceDescriptor_t
 * @param       ppKeyDeviceDescriptor - pointer to pointer to keyDeviceDescriptor_t
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
uint8 macIncomingFrameSecurityMaterialRetrieval( macRx_t *pMsg,
                                                 keyDescriptor_t **ppKeyDescriptor,
                                                 deviceDescriptor_t **ppDeviceDescriptor,
                                                 keyDeviceDescriptor_t **ppKeyDeviceDescriptor)
{
#ifdef FEATURE_MAC_SECURITY
  uint8  defaultKeySource[MAC_KEY_SOURCE_MAX_LEN];
  uint8  lookupData[MAC_MAX_KEY_LOOKUP_LEN];
  uint8  lookupDataSize;
  uint8  srcAddrMode;
  uint8  deviceLoopupData[MAC_DEVICE_LOOKUP_LONG_LEN];
  uint8  deviceLookupSize;


  srcAddrMode = pMsg->mac.srcAddr.addrMode;

  /* Explicit key identification */
  if (pMsg->sec.keyIdMode == MAC_KEY_ID_MODE_1)
  {
      lookupDataSize = MAC_KEY_ID_8_LEN;
      MAP_MAC_MlmeGetSecurityReq (MAC_DEFAULT_KEY_SOURCE, defaultKeySource);
      MAP_osal_memcpy(lookupData, defaultKeySource, lookupDataSize-1);
      lookupData[lookupDataSize-1] = pMsg->sec.keyIndex;
  }
  else
  {
      return (MAC_UNAVAILABLE_KEY);
  }

  if (MAP_macKeyDescriptorLookup( lookupData, lookupDataSize, ppKeyDescriptor ) != MAC_SUCCESS)
  {
    /* Key descriptor not found */
    return (MAC_UNAVAILABLE_KEY);
  }

  /* Key descriptor found. Determine device lookup data. */
  if (srcAddrMode == SADDR_MODE_EXT)
  {
    deviceLookupSize = MAC_DEVICE_LOOKUP_LONG_LEN;
    MAP_sAddrExtCpy(deviceLoopupData, pMsg->mac.srcAddr.addr.extAddr);
  }
  else {
      /* Invalid short address mode */
      return (MAC_UNAVAILABLE_KEY);
  }

  return (MAP_macBlacklistChecking( *ppKeyDescriptor, deviceLoopupData, deviceLookupSize,
                            ppDeviceDescriptor, ppKeyDeviceDescriptor));
#else
  return (MAC_SUCCESS);
#endif /*FEATURE_MAC_SECURITY  */
}

