nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/**************************************************************************************************
 * @fn          macCcmStarInverseTransform
 *
 * @brief       This function is used to do CCM* inverse transformation. The inputs to this
 *              procedure are ExtAddress of the device descriptor, the frame counter, the security
 *              level, the key, and the secured frame. The output from this procedure is c data.
 *
 * input parameters
 *
 * @param       pKey - pointer to key
 * @param       frameCounter - frame counter
 * @param       securityLevel - security level
 * @param       pAData - pointer to a data
 * @param       aDataLen - a data length
 * @param       pCData - pointer to c data
 * @param       cDataLen - c data length
 * @param       pExtAddr - pointer to exteneded address
 *
 * output parameters
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
uint8 macCcmStarInverseTransform( uint8    *pKey,
                                  uint32   frameCounter,
                                  uint8    securityLevel,
                                  uint8    *pAData,
                                  uint16   aDataLen,
                                  uint8    *pCData,
                                  uint16   cDataLen,
                                  uint8    *pExtAddr )
{
#ifdef FEATURE_MAC_SECURITY
  uint8 nonce[MAC_NONCE_LEN];
  uint8 *pNonce;
  uint8 mic[MAC_MIC_LEN];
  uint8 status = MAC_SUCCESS;
  uint8 mLen;
  uint8 i;

  if (securityLevel == MAC_SEC_LEVEL_NONE)
  {
    return (MAC_SUCCESS);
  }

#ifdef DEBUG_SECURITY_TRACE
  DBG_PRINT1(DBGSYS, "aDataLen len, 0x%X", aDataLen );
  DBG_PRINT4(DBGSYS, "aData[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pAData[0], pAData[1], pAData[2], pAData[3]);
  DBG_PRINT4(DBGSYS, "aData[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pAData[4], pAData[5], pAData[6], pAData[7]);
  DBG_PRINT4(DBGSYS, "aData[8..11]=0x%X, 0x%X, 0x%X, 0x%X", pAData[8], pAData[9], pAData[10], pAData[11]);
  DBG_PRINT4(DBGSYS, "aData[12..15]=0x%X, 0x%X, 0x%X, 0x%X", pAData[12], pAData[13], pAData[14], pAData[15]);
  DBG_PRINT4(DBGSYS, "aData[16..19]=0x%X, 0x%X, 0x%X, 0x%X", pAData[16], pAData[17], pAData[18], pAData[19]);

  DBG_PRINT1(DBGSYS, "Encrypt len, 0x%X", cDataLen );
  DBG_PRINT4(DBGSYS, "Encrypt[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pCData[0], pCData[1], pCData[2], pCData[3]);
  DBG_PRINT4(DBGSYS, "Encrypt[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pCData[4], pCData[5], pCData[6], pCData[7]);

  DBG_PRINTL1(DBGSYS, "FrameCntr= %ul", frameCounter);

  DBG_PRINT4(DBGSYS, "Key[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pKey[0], pKey[1], pKey[2], pKey[3]);
  DBG_PRINT4(DBGSYS, "Key[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pKey[4], pKey[5], pKey[6], pKey[7]);
  DBG_PRINT4(DBGSYS, "Key[8..11]=0x%X, 0x%X, 0x%X, 0x%X", pKey[8], pKey[9], pKey[10], pKey[11]);
  DBG_PRINT4(DBGSYS, "Key[12..15]=0x%X, 0x%X, 0x%X, 0x%X", pKey[12], pKey[13], pKey[14], pKey[15]);
#endif /* DEBUG_SECURITY_TRACE */

  /* Data authenticity length */
  mLen = macAuthTagLen[securityLevel];

  /* determine a data length and m data length */
  if ( securityLevel < MAC_SEC_LEVEL_ENC )
  {
    /* Auth only, the MIC will be appended at the end of secured payload fields */
    pCData += (cDataLen - mLen);
    cDataLen = mLen;

    /* Should not include MIC length */
    aDataLen -= mLen;
  }
  else
  {
    /* Auth and Encrypt */
    aDataLen -= cDataLen;
  }

  /* Build nonce, start with extended address */
  pNonce = &nonce[0];
  for (i = 0; i < SADDR_EXT_LEN; i++)
  {
    *pNonce++ = *(pExtAddr + i);
  }

  /* follow with frame counter */
  *pNonce++ = BREAK_UINT32( frameCounter, 3 );
  *pNonce++ = BREAK_UINT32( frameCounter, 2 );
  *pNonce++ = BREAK_UINT32( frameCounter, 1 );
  *pNonce++ = BREAK_UINT32( frameCounter, 0 );

  /* follow with security level */
  *pNonce = securityLevel;

  AESCCM_Transaction trans;
  trans.securityLevel = securityLevel;
  trans.pKey = pKey;
  trans.header = pAData;
  trans.data = pCData;
  trans.mic = mic;
  trans.nonce = nonce;
  trans.headerLength = aDataLen;
  trans.dataLength = cDataLen;
  trans.micLength = mLen;

  status = MAP_macCcmDecrypt(&trans);

#ifdef DEBUG_SECURITY_TRACE
  DBG_PRINT4(DBGSYS, "Decrypt[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pCData[0], pCData[1], pCData[2], pCData[3]);
  DBG_PRINT4(DBGSYS, "Decrypt[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pCData[4], pCData[5], pCData[6], pCData[7]);
#endif /* DEBUG_SECURITY_TRACE */

#ifdef DEBUG_SECURITY_TRACE
  DBG_PRINT1(DBGSYS, "Status= 0x%X", status );
#endif /* DEBUG_SECURITY_TRACE */
  return status;
#else
  return(MAC_SUCCESS);
#endif /*#ifdef FEATURE_MAC_SECURITY*/
}



/**************************************************************************************************
 * @fn          macIncomingFrameSecurity
 *
 * @brief       The input to this procedure is the frame to be unsecured. The outputs from this
 *              procedure are the unsecured frame, the security level, the key identifier mode, the
 *              key source, the key index, and the status of the procedure. All outputs of this
 *              procedure are assumed to be invalid unless and until explicitly set in this
 *              procedure. It is assumed that the PIB attributes associating KeyDescriptors in
 *              macKeyTable with a single, unique device or a number of devices will have been
 *              established by the next higher layer.
 *
 * input parameters
 *
 * @param       pMsg - pointer to the frame to be unsecured.
 *
 * output parameters
 *
 * @param       pMsg - pointer to the unsecured frame
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macIncomingFrameSecurity( macRx_t *pMsg )
{
#ifdef FEATURE_MAC_SECURITY
  keyDescriptor_t       *pKeyDescriptor = NULL;
  deviceDescriptor_t    *pDeviceDescriptor = NULL;
  keyDeviceDescriptor_t *pKeyDeviceDescriptor = NULL;
  uint8                 securityLevel;
  uint8                 status;
  uint8                 *pSecuredPayload;
  uint16                securedPayloadLen;
#ifndef FEATURE_WISUN_SUPPORT
  uint8                 frameType;
  uint8                 securityLevelStatus;
#endif
  uint8                 *pExtAddress;
  securityLevel = pMsg->sec.securityLevel;

