nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
  /* Incoming Frame Security Material Retrieval */
  if ((status = MAP_macIncomingFrameSecurityMaterialRetrieval( pMsg,
                                                           &pKeyDescriptor,
                                                           &pDeviceDescriptor,
                                                           &pKeyDeviceDescriptor))
      == MAC_UNAVAILABLE_KEY)
  {
    pMsg->hdr.status = status;
#ifdef FH_HOP_DEBUG
    FH_Dbg.numKeyRetrievalErr++;
#endif
    return (status);
  }

  /* nanostack does not store device info here until getting neighbor solicit with ARO */
  if(status == MAC_SUCCESS)
  {
      pExtAddress = (uint8 *)pDeviceDescriptor->extAddress;
#if 0 // Need to add check for key Id & framecounter
      if(securityLevel == 6) /* WISUN mandates security level of 6 */
      {
          if ((pMsg->internal.frameCntr == MAC_MAX_FRAME_COUNTER ) || (pMsg->internal.frameCntr < (uint8 *)pDeviceDescriptor->frameCounter ))
          {
            pMsg->hdr.status = MAC_COUNTER_ERROR;
#ifdef FH_HOP_DEBUG
            FH_Dbg.numFramecounterErr++;
#endif
            return (MAC_COUNTER_ERROR);
          }
      }

      /* Increase the frame counter and set the frame counter in the device descriptor */
      pDeviceDescriptor->frameCounter = pMsg->internal.frameCntr + 1;
      //pDeviceDescriptor->frameCounter[keyIndex] = pMsg->internal.frameCntr + 1;

      /* set the black list element in the key device descriptor */
      if (pDeviceDescriptor->frameCounter == MAC_MAX_FRAME_COUNTER)
      {
        pKeyDeviceDescriptor->blackListed = TRUE;
      }
#endif

  }
  else
  {
#ifdef FEATURE_WISUN_SUPPORT
      pExtAddress = (uint8 *)pMsg->mac.srcAddr.addr.extAddr;
#else
      return (MAC_UNAVAILABLE_KEY);
#endif
  }


  /* Initialize secured payload pointer and length */
  pSecuredPayload   = pMsg->internal.ptrCData;
  securedPayloadLen = pMsg->msdu.len - (pMsg->internal.ptrCData - pMsg->msdu.p);

  /* CCM needs to be done here.
   * This function will replace the secured frame with a unsecured frame.
   */
  MAC_ASSERT(pKeyDescriptor != NULL);

  if ((status = MAP_macCcmStarInverseTransform( pKeyDescriptor->key,
                                            pMsg->internal.frameCntr,
                                            securityLevel,
                                            pMsg->mhr.p,
                                            pMsg->mhr.len,
                                            pSecuredPayload,
                                            securedPayloadLen,
                                            pExtAddress))
      != MAC_SUCCESS)
  {
    pMsg->hdr.status = status;
#ifdef FH_HOP_DEBUG
    FH_Dbg.numDecryptionErr++;
#endif

    return (status);
  }

  /* Subtract MIC length from the msdu.len */
  pMsg->msdu.len -= macAuthTagLen[securityLevel];

  if (pMsg->payloadIePresent)
  {
    MAP_macUpdatePayloadIEPtr(pMsg);
  }
#ifndef FEATURE_WISUN_SUPPORT
  frameType = pMsg->internal.fcf & MAC_FCF_FRAME_TYPE_MASK;

  /* Wi-SUN does not have command frame */
  pMsg->internal.cmdFrameId = 0;

  /* Check the security level */
  if ((status = MAP_macIncomingSecurityLevelChecking( securityLevel, frameType,
                                                  pMsg->internal.cmdFrameId ))
      == MAC_IMPROPER_SECURITY_LEVEL)
  {
    pMsg->hdr.status = status;
    return (status);
  }

  /* Save the security level check result */
  securityLevelStatus = status;

  /* Check the key usage policy */
  if ((status = MAP_macIncomingKeyUsagePolicyChecking( pKeyDescriptor, frameType,
                                                   pMsg->internal.cmdFrameId ))
      != MAC_SUCCESS)
  {
    pMsg->hdr.status = status;
    return (status);
  }
#endif
#ifndef FEATURE_WISUN_SUPPORT
#warning "MAC Incoming Frame Counter Handling Needs to be fixed"
  /* Check the frame counter and compare with the frame counter in device descriptor */
  if ((pMsg->internal.frameCntr == MAC_MAX_FRAME_COUNTER ) || (pMsg->internal.frameCntr < pDeviceDescriptor->frameCounter ))
  {
    pMsg->hdr.status = MAC_COUNTER_ERROR;
    return (MAC_COUNTER_ERROR);
  }

  /* Increase the frame counter and set the frame counter in the device descriptor */
  pDeviceDescriptor->frameCounter = pMsg->internal.frameCntr + 1;
  //pDeviceDescriptor->frameCounter[keyIndex] = pMsg->internal.frameCntr + 1;

  /* set the black list element in the key device descriptor */
  if (pDeviceDescriptor->frameCounter == MAC_MAX_FRAME_COUNTER)
  {
    pKeyDeviceDescriptor->blackListed = TRUE;
  }
#endif
  pMsg->hdr.status = MAC_SUCCESS;
#endif /*#ifdef FEATURE_MAC_SECURITY  */

  return (MAC_SUCCESS);

}

/**************************************************************************************************
 * @fn          macOutgoingFrameKeyDescRetrieval
 *
 * @brief       The inputs to this procedure are the frame to be secured and the security
 *              parameters from the originating primitive. The output from this procedure is
 *              the pointer to the corresponding key descriptor if passed, or NULL otherwise.
 *
 * @param       pBuf - Pointer to buffer containing tx struct.
 * @param       pDstAddr - Destination address.
 * @param       dstPanId - Destination PAN ID.
 *
 * @return      pointer to key desriptor if successful, otherwise NULL.
 **************************************************************************************************
 */
keyDescriptor_t* macOutgoingFrameKeyDescRetrieval( ApiMac_sec_t  *pSec,
                                    sAddr_t  *pDstAddr,
                                    uint16   dstPanId )
{
#ifdef FEATURE_MAC_SECURITY
  uint8            defaultKeySource[MAC_KEY_SOURCE_MAX_LEN];
  uint8            lookupData[MAC_MAX_KEY_LOOKUP_LEN];
  uint8            lookupDataSize;
  keyDescriptor_t  *pKeyDescriptor = NULL;

  lookupDataSize = MAC_KEY_ID_8_LEN;
  if (pSec->keyIdMode == MAC_KEY_ID_MODE_1)
  {
    MAP_MAC_MlmeGetSecurityReq (MAC_DEFAULT_KEY_SOURCE, defaultKeySource);
    MAP_osal_memcpy(lookupData, defaultKeySource, lookupDataSize-1);
    lookupData[lookupDataSize-1] = pSec->keyIndex;
  }
  else
  {
    return NULL;
  }

  if (MAP_macKeyDescriptorLookup( lookupData, lookupDataSize, &pKeyDescriptor ) != MAC_SUCCESS)
  {
    return NULL;
  }

  /* Key descriptor found */
  return (pKeyDescriptor);
#else
  return (NULL);
#endif /*FEATURE_MAC_SECURITY*/
}

