nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/**************************************************************************************************
 * @fn          macOutgoingFrameSecurity
 *
 * @brief       The inputs to this procedure are the frame to be secured and the security
 *              parameters from the originating primitive or automatic request PIB attributes.
 *              The outputs from this procedure are the status of the procedure and, if this status
 *              is MAC_SUCCESS, pointer to the key to be used to secure the outgoing frame.
 *
 * input parameters
 *
 * @param       pBuf - Pointer to buffer containing tx struct.
 * @param       pDstAddr - Destination address.
 * @param       dstPanId - Destination PAN ID.
 *
 * output parameters
 *
 * @param       ppKeyDesc - Pointer to pointer to key descripter to be used to secure
 *                          the outgoing frame.
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macOutgoingFrameSecurity( macTx_t  *pBuf,
                                                 sAddr_t  *pDstAddr,
                                                 uint16   dstPanId,
                                                 keyDescriptor_t **ppKeyDesc )
{
#ifdef FEATURE_MAC_SECURITY
  uint8   i;
  uint8   expansionLen;
  uint8   keyIdMode;
  uint8   securityLevel;
  uint8   *p;
  uint8   scf;

  /* Copy keyIdMode and securityLevel to local variables */
  keyIdMode     = pBuf->sec.keyIdMode;
  securityLevel = pBuf->sec.securityLevel;

  /* Determine the data expansion as AuxLen + AuthTagLen */
  expansionLen = MAC_SEC_CONTROL_FIELD_LEN  + MAC_FRAME_COUNTER_LEN +
                 macKeySourceLen[keyIdMode] + macAuthTagLen[securityLevel];

  /* check whether the length of the frame to be secured, including data expansion, is less
   * than or equal to aMaxPHYPacketSize. If this check fails, the procedure shall return with a status
   * of FRAME_TOO_LONG.
   */
  if (expansionLen + pBuf->msdu.len > macCfg.macMaxFrameSize)
  {
    pBuf->hdr.status = MAC_FRAME_TOO_LONG;
    return (MAC_FRAME_TOO_LONG);
  }

  /* security level is zero */
  if (securityLevel == MAC_SEC_LEVEL_NONE)
  {
    pBuf->hdr.status = MAC_SUCCESS;
    return (MAC_SUCCESS);
  }

  /* obtain the key descriptor using the outgoing frame key retrieval procedure */
  if ((*ppKeyDesc = MAP_macOutgoingFrameKeyDescRetrieval(&pBuf->sec, pDstAddr, dstPanId)) == NULL)
  {
    pBuf->hdr.status = MAC_UNAVAILABLE_KEY;
    return (MAC_UNAVAILABLE_KEY);
  }

  //TODO: This should be moved to LMAC as well
  if ((*ppKeyDesc)->frameCounter == MAC_MAX_FRAME_COUNTER)
  {
    /* Note that to be strictly compliant, MAC should be able to transmit at max frame counter value
     * as well and then should reject further usage of the frame counter.
     * But such compliance requiremnet is too trivial to add more code and RAM for it. */
    pBuf->hdr.status = MAC_COUNTER_ERROR;
    return (MAC_COUNTER_ERROR);
  }

  /* Insert auxiliary security header */
  p = pBuf->msdu.p - 1;

  /* build key identifier field */
  if (keyIdMode > MAC_KEY_ID_MODE_IMPLICIT)
  {
    *p-- = pBuf->sec.keyIndex;

    /* build key source for MAC_KEY_ID_MODE_4 and MAC_KEY_ID_MODE_8 */
    for (i = macKeySourceLen[keyIdMode]-MAC_KEY_ID_1_LEN; i > 0; i--)
    {
      *p-- = pBuf->sec.keySource[i-1];
    }
  }
  /* save the frame count location for later use (FH mode) */
  pBuf->internal.ptrFrameCnt = p ;
  pBuf->internal.frameCntr = (*ppKeyDesc)->frameCounter;

  /* build frame counter */
  *p-- = BREAK_UINT32( pBuf->internal.frameCntr, 3 );
  *p-- = BREAK_UINT32( pBuf->internal.frameCntr, 2 );
  *p-- = BREAK_UINT32( pBuf->internal.frameCntr, 1 );
  *p-- = BREAK_UINT32( pBuf->internal.frameCntr, 0 );

  /* build security control field */
  scf  = ((securityLevel << MAC_SCF_SECURITY_LEVEL_POS) & MAC_SCF_SECURITY_LEVEL_MASK);
  scf |= ((keyIdMode << MAC_SCF_KEY_IDENTIFIER_POS) & MAC_SCF_KEY_IDENTIFIER_MASK);
  *p   = scf;

  /* increment length by size of security header */
  pBuf->msdu.len += (uint8) (pBuf->msdu.p - p);
  pBuf->msdu.p = p;

  pBuf->hdr.status = MAC_SUCCESS;
#endif /*FEATURE_MAC_SECURITY*/
  return MAC_SUCCESS;
}

/**************************************************************************************************
 * @fn          macCcmStarTransform
 *
 * @brief       This function is used to do CCM* transformation. The inputs to this procedure are
 *              the key, nonce, a data, m data. The output from this procedure is c data.
 *
 * input parameters
 *
 * @param       pKey - pointer to key
 * @param       frameCounter - frame counter value
 * @param       securityLevel - security level
 * @param       pAData - pointer to a data
 * @param       aDataLen - a data length
 * @param       pMData - pointer to m data
 * @param       mDataLen - m data length
 *
 * output parameters
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macCcmStarTransform( uint8    *pKey,
                                            uint32   frameCounter,
                                            uint8    securityLevel,
                                            uint8    *pAData,
                                            uint16   aDataLen,
                                            uint8    *pMData,
                                            uint16   mDataLen )
{
#ifdef FEATURE_MAC_SECURITY
  uint8 nonce[MAC_NONCE_LEN];
  uint8 *pNonce;
  uint8 mic[MAC_MIC_LEN];
  uint8 status;
  uint8 mLen;
  uint8 i;

  MAC_ASSERT( aDataLen > mDataLen && pMData > pAData );

  if (securityLevel == MAC_SEC_LEVEL_NONE)
  {
    return (MAC_SUCCESS);
  }

#ifdef DEBUG_SECURITY_TRACE
  DBG_PRINT1(DBGSYS, "aDataLen len, 0x%X", aDataLen );
  DBG_PRINT4(DBGSYS, "aData[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pAData[0], pAData[1], pAData[2], pAData[3]);
  DBG_PRINT4(DBGSYS, "aData[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pAData[4], pAData[5], pAData[6], pAData[7]);
  DBG_PRINT4(DBGSYS, "aData[8..11]=0x%X, 0x%X, 0x%X, 0x%X", pAData[8], pAData[9], pAData[10], pAData[11]);
  DBG_PRINT4(DBGSYS, "aData[12..15]=0x%X, 0x%X, 0x%X, 0x%X", pAData[12], pAData[13], pAData[14], pAData[15]);
  DBG_PRINT4(DBGSYS, "aData[16..19]=0x%X, 0x%X, 0x%X, 0x%X", pAData[16], pAData[17], pAData[18], pAData[19]);

  DBG_PRINT1(DBGSYS, "PlainText len, 0x%X", mDataLen );
  DBG_PRINT4(DBGSYS, "MData[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pMData[0], pMData[1], pMData[2], pMData[3]);
  DBG_PRINT4(DBGSYS, "MData[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pMData[4], pMData[5], pMData[6], pMData[7]);

