nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
  DBG_PRINTL1(DBGSYS, "FrameCntr= %ul", frameCounter);

  DBG_PRINT4(DBGSYS, "Key[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pKey[0], pKey[1], pKey[2], pKey[3]);
  DBG_PRINT4(DBGSYS, "Key[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pKey[4], pKey[5], pKey[6], pKey[7]);
  DBG_PRINT4(DBGSYS, "Key[8..11]=0x%X, 0x%X, 0x%X, 0x%X", pKey[8], pKey[9], pKey[10], pKey[11]);
  DBG_PRINT4(DBGSYS, "Key[12..15]=0x%X, 0x%X, 0x%X, 0x%X", pKey[12], pKey[13], pKey[14], pKey[15]);
#endif /* DEBUG_SECURITY_TRACE */



  /* Data authenticity length */
  mLen = macAuthTagLen[securityLevel];

  /* Should not include MIC length */
  mDataLen -= mLen;

  /* determine a data length and m data length */
  if ( securityLevel < MAC_SEC_LEVEL_ENC )
  {
    /* Auth only, the MIC will be appended at the end of unsecured payload fields */
    pMData += mDataLen;
    mDataLen = 0;
    aDataLen -= mLen;
  }
  else
  {
    /* Auth and Encrypt */
    aDataLen -= (mDataLen + mLen);
  }

  /* Build nonce, start with extended address */
  pNonce = &nonce[0];
  for (i = 0; i < SADDR_EXT_LEN; i++)
  {
    *pNonce++ = pMacPib->extendedAddress.addr.extAddr[i];
  }

  /* follow with frame counter */
  *pNonce++ = BREAK_UINT32( frameCounter, 3 );
  *pNonce++ = BREAK_UINT32( frameCounter, 2 );
  *pNonce++ = BREAK_UINT32( frameCounter, 1 );
  *pNonce++ = BREAK_UINT32( frameCounter, 0 );

  /* follow with security level */
  *pNonce = securityLevel;

  AESCCM_Transaction trans;
  trans.securityLevel = securityLevel;
  trans.pKey = pKey;
  trans.header = pAData;
  trans.data = pMData;
  trans.mic = mic;
  trans.nonce = nonce;
  trans.headerLength = aDataLen;
  trans.dataLength = mDataLen;
  trans.micLength = mLen;

  status = MAP_macCcmEncrypt(&trans);

  if (status)
  {
    return status;
  }

  /* Append MIC to end of message */
  for (i=0; i < mLen; i++)
  {
    *(pMData + mDataLen + i) = mic[i];
  }

#ifdef DEBUG_SECURITY_TRACE
  DBG_PRINT1(DBGSYS, "CipherText len, 0x%X", mDataLen );
  DBG_PRINT4(DBGSYS, "CData[0..3]=0x%X, 0x%X, 0x%X, 0x%X", pMData[0], pMData[1], pMData[2], pMData[3]);
  DBG_PRINT4(DBGSYS, "CData[4..7]=0x%X, 0x%X, 0x%X, 0x%X", pMData[4], pMData[5], pMData[6], pMData[7]);
#endif /* DEBUG_SECURITY_TRACE */
#endif /*#ifdef FEATURE_MAC_SECURITY */
  return (MAC_SUCCESS);
 }

/**************************************************************************************************
 * @fn          getLostBeaconCount
 *
 * @brief       This function is called by the low level MAC to get the number of missed beacons.
 *
 * input parameters
 *
 * None
 *
 * output parameters
 *
 * @return      uint8_t Remaining beacons to sync loss. Range of 0 to MAC_A_MAX_LOST_BEACONS.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8_t getLostBeaconCount(void)
{
    return (macBeaconDevice.lostCount);
}


/**************************************************************************************************
 * @fn          MAC_ResumeReq
 *
 * @brief       This direct execute function resumes the MAC after a successful return from
 *              MAC_YieldReq().
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void MAC_ResumeReq(void)
{
  halIntState_t s;

  /* Re-initialize PHY */
  MAP_macLowLevelResume();

  HAL_ENTER_CRITICAL_SECTION(s);

  /* Invalidate current channel and power numbers so that they can be
   * re-initialized anyway after PHY re-initialization.
   */
  MAP_macRadioSwInit();

  /* Re-initialize radio with the values from the PIB. */
  MAP_macRadioSetTxPower(pMacPib->phyTransmitPower);
  MAP_macRadioSetPanCoordinator(macPanCoordinator);
  MAP_macRadioSetPanID(pMacPib->panId);
  MAP_macRadioSetShortAddr(pMacPib->shortAddress);
  MAP_macRadioSetIEEEAddr(pMacPib->extendedAddress.addr.extAddr);
  HAL_EXIT_CRITICAL_SECTION(s);

  /* Re-initialize radio channel */
  MAP_macRadioSetChannel(pMacPib->logicalChannel);

  /* Turn RX back on if it should be on - low level reset turns it off. */
  MAP_MAC_MlmeSetReq(MAC_RX_ON_WHEN_IDLE, &pMacPib->rxOnWhenIdle);
}

/**************************************************************************************************
 * @fn          macAllocTxBuffer
 *
 * @brief       This function allocates an OSAL message buffer to build a transmission frame.
 *
 * input parameters
 *
 * @param       cmd - Command frame identifier.
 * @param       *sec - pointer to MAC security parameters
 *
 * output parameters
 *
 * None.
 *
 * @return      Pointer to allocated buffer or NULL if allocation failed.
 **************************************************************************************************
 */

MAC_INTERNAL_API macTx_t *macAllocTxBuffer(uint8 cmd, ApiMac_sec_t *sec)
{
  macTx_t       *pMsg;
  uint8         len;
  uint8         micLen;

  /* we have table of cmd frame size and sizeof(msg) indexed by cmd */
  len = macCmdBufSize[cmd];
#ifdef FEATURE_FREQ_HOP_MODE
  if ( MAC_FH_ENABLED && MAC_FH_GET_IE_LEN_FN )
  {
    uint16 ieLen = 0;
    /* buffer space for FH header IE's if any for this command */
    ieLen = MAC_FH_GET_IE_LEN_FN( macCmdIncludeFHIe[cmd] & MAC_FH_HEADER_IE_MASK);
    /* buffer space for FH Payload IE's if any for this command */
    ieLen += MAC_FH_GET_IE_LEN_FN( macCmdIncludeFHIe[cmd] & MAC_FH_PAYLOAD_IE_MASK);

    if ( ieLen )
    {
      len += ieLen + MAC_HEADER_IE_HEADER_LEN + MAC_PAYLOAD_IE_HEADER_LEN;
    }
  }
#endif

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
      if (pMacPib->securityEnabled == TRUE && sec->securityLevel > MAC_SEC_LEVEL_NONE)
      {
        /* Save local copy */
        micLen = macAuthTagLen[sec->securityLevel];

        /* Add security header length as data offset.
         * Do not add MIC length as it is not part of security header.
         */
        len += (MAC_SEC_CONTROL_FIELD_LEN + MAC_FRAME_COUNTER_LEN + macKeySourceLen[sec->keyIdMode]);
      }
      else
      {
        micLen = 0;
      }
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
    else
    {
        micLen = 0;
    }
#endif
#else
  (void)sec;
  micLen = 0;
#endif /* FEATURE_MAC_SECURITY */

  /* allocation includes micLen including MAC_PHY_PHR_LEN.
   * Low level MAC will fill in PHR.
   */
#ifndef ENHACK_MALLOC
  if(cmd == MAC_INTERNAL_ENH_ACK)
  {
    if((MAC_PHY_PHR_LEN + len + micLen) > 250)
    {
      MAC_ASSERT(0);
    }
    else
    {
      pMsg = (macTx_t *)enhancedAckBuf;
    }
  }
#ifdef FEATURE_WISUN_EDFE_SUPPORT
  else if(cmd == MAC_INTERNAL_EDFE_EFRM)
  {
      if((MAC_PHY_PHR_LEN + len + micLen) > MAC_EDFE_MAX_FRAME)
      {
        MAC_ASSERT(0);
      }
      else
      {
        pMsg = (macTx_t *)edfeEfrmBuf;
      }
  }
#endif
  else
  {
    pMsg = (macTx_t *) MAP_osal_msg_allocate(MAC_PHY_PHR_LEN + len + micLen);
  }
#else
    pMsg = (macTx_t *) MAP_osal_msg_allocate(MAC_PHY_PHR_LEN + len + micLen);
#endif
  if (pMsg)
  {
    MAP_osal_memset( pMsg, 0x0, MAC_PHY_PHR_LEN + len + micLen);

