nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
    /* Initialize to zero the internal data structure */
    MAP_osal_memset(&(pMsg->internal), 0x0, sizeof(macTxIntData_t));

    /* Initialize the headerIeInfo and PayloadIeInfo */
    MAP_osal_memset( &(pMsg->internal.headerIeInfo), MAC_HEADER_IE_TERM,
                 sizeof(headerIeInfo_t) * MAC_HEADER_IE_MAX );
    MAP_osal_memset( &(pMsg->internal.payloadIeInfo), MAC_PAYLOAD_IE_TERM_GID,
                 sizeof(payloadIeInfo_t) * MAC_PAYLOAD_IE_MAX );

    /* set up data pointer to end of message (exclude MIC); to be built in reverse */
    pMsg->msdu.p = (uint8 *) pMsg + len;
    pMsg->msdu.len = micLen;
#ifndef FEATURE_WISUN_SUPPORT
    /* set command identifier */
    if ((cmd > MAC_INTERNAL_DATA) && (cmd < MAC_INTERNAL_COEXIST_EB_REQ))
    {
      *(--pMsg->msdu.p) = cmd - 1;
      pMsg->msdu.len++;
      len--;
    }
#endif
    pMsg->internal.totalLen = len;

    return pMsg;
  }
  /* alloc failed; try to alloc a smaller buffer for failure message */
  else
  {
    pMsg = (macTx_t *) MAP_osal_msg_allocate(sizeof(macEventHdr_t));
    if (pMsg)
    {
      /* treat as tx failure; send osal msg to MAC */
      pMsg->hdr.event = MAC_NO_ACTION_EVT;
      pMsg->hdr.status = MAC_NO_RESOURCES;
      MAP_osal_msg_send(macTaskId, (uint8 *) pMsg);
    }
    return NULL;
  }
}

/**************************************************************************************************
 * @fn          macBuildDataFrame
 *
 * @brief       This function builds and sends a data frame in buffer pEvent.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macBuildDataFrame(macEvent_t *pEvent)
{
  uint8 status = MAC_SUCCESS;
  uint8 elideSeqNo = 0;

  if (MAC_FH_ENABLED)
  {
    /* set parameters */

    if (pEvent->dataReq.mac.dstAddr.addrMode == SADDR_MODE_NONE)
    {
      pEvent->tx.internal.frameType  = MAC_INTERNAL_DATA_BROADCAST;
      pEvent->tx.internal.be = (pMacDataTx->internal.txOptions & MAC_TXOPTION_ALT_BE) ? pMacPib->altBe : pMacPib->minBe;
      pEvent->tx.internal.be += 2;
    }
    else
    {
#if defined(FEATURE_WISUN_EDFE_SUPPORT) || defined(FEATURE_WISUN_MIN_EDFE)
      if(pEvent->dataReq.mac.includeFhIEs & MAC_FH_FC_IE)
      {
          elideSeqNo = 1;
#ifndef FEATURE_EDFE_TEST_MODE
          pEvent->tx.internal.frameType  = MAC_INTERNAL_DATA_EDFE;
#else
          pEvent->tx.internal.frameType  = MAC_INTERNAL_DATA_UNICAST;
#endif
          pEvent->tx.internal.be = (pMacDataTx->internal.txOptions & MAC_TXOPTION_ALT_BE) ? pMacPib->altBe : pMacPib->minBe;
          macEdfeInfo.ieInfo.txfc = 0;
          macEdfeInfo.ieInfo.rxfc = MAC_EDFE_MAX_RXFC;
      }
      else
#endif
      {
          pEvent->tx.internal.frameType  = MAC_INTERNAL_DATA_UNICAST;
          pEvent->tx.internal.be = (pMacDataTx->internal.txOptions & MAC_TXOPTION_ALT_BE) ? pMacPib->altBe : pMacPib->minBe;
      }
    }
#ifdef FEATURE_WISUN_SUPPORT
    uint16_t mpxId = 0;
    if((pEvent->dataReq.mac.includeFhIEs & MAC_FH_MPX_IE) && pEvent->dataReq.mac.pIEList)
    {
        uint8_t *mpxPtr = pEvent->dataReq.mac.pIEList;
        mpxId = (mpxPtr[3]) | ((mpxPtr[4]) << 8);
    }

    if(mpxId == MPX_ID_KMP)
    {
        pEvent->tx.internal.fhFrameType  = MAC_FH_FRAME_EAPOL;
    }
    else
    {
        pEvent->tx.internal.fhFrameType  = MAC_FH_FRAME_DATA;
    }
#else
    pEvent->tx.internal.fhFrameType  = MAC_FH_FRAME_DATA;
#endif
    pEvent->tx.internal.nb = 0;
    MAP_osal_memcpy(&pEvent->tx.internal.dest.dstAddr, &pEvent->dataReq.mac.dstAddr, sizeof(sAddr_t));
    //MAP_osal_memcpy(pEvent->tx.internal.dest.destAddr, pEvent->dataReq.mac.dstAddr.addr.extAddr, SADDR_EXT_LEN);
  }

  pEvent->tx.internal.txOptions  = pEvent->dataReq.mac.txOptions;
  pEvent->tx.internal.channel    = pEvent->dataReq.mac.channel;
  pEvent->tx.internal.power      = pEvent->dataReq.mac.power;

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
      /* If there is no IE, only the legacy payload will be secured. */
      pEvent->tx.internal.ptrMData = pEvent->tx.msdu.p;
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif

  if ( MAC_PAYLOAD_IE_TERM_GID != pEvent->tx.internal.payloadIeInfo[0].gId )
  {
#ifdef FEATURE_WISUN_SUPPORT
    bool includeTermIe = (0 == pEvent->dataReq.mac.payloadIELen)?TRUE:FALSE;
#else
    bool includeTermIe = 0; // not needed because WiSUN has MPX-IE
#endif
    /* Builds MAC specific payload IE's if any and also adds the payload termination
       IE if requested */
    status = MAP_macBuildPayloadIes(&pEvent->tx, pEvent->tx.internal.payloadIeInfo,
                                includeTermIe, FALSE);
  }

  if (status != MAC_SUCCESS)
  {
    return status;
  }

  if ( (MAC_HEADER_IE_TERM != pEvent->tx.internal.headerIeInfo[0].elementId) ||
       (NULL != pEvent->tx.internal.ptrPayloadIE) )
  {
    /* Builds the MAC specific header IE's if any and also adds the header
       termination IE */
    status = MAP_macBuildHeaderIes(&pEvent->tx, pEvent->tx.internal.headerIeInfo);
  }

  if (status != MAC_SUCCESS)
  {
    return status;
  }

  /* build header */
  status = MAP_macBuildHeader(&pEvent->tx, pEvent->dataReq.mac.srcAddrMode,
                          &pEvent->dataReq.mac.dstAddr, pEvent->dataReq.mac.dstPanId, elideSeqNo);

  if (status == MAC_SUCCESS)
  {
    /* check for the maximum length
     * if the msdu.len is greater than MAX length return error
     *
     */
    if (pEvent->tx.msdu.len > macCfg.macMaxFrameSize)
    { /* TX data packet is too big, just drop */
      macTx_t *pMsg;

      pMsg = &pEvent->tx;
      pMsg->hdr.status = MAC_FRAME_TOO_LONG;
      MAP_macDataTxComplete(pMsg);
    }
    else
    {
      DBG_PRINT0(DBGSYS, "Data Enqueued");

      /* queue frame for transmission */
      MAP_macDataTxEnqueue(&pEvent->tx);
    }
  }
  return status;
}

