nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/**************************************************************************************************
 * @fn          macDataTxComplete
 *
 * @brief       This function is called when a data transmission attempt is complete.  If this
 *              is for a non-internal data frame the MAC callback is executed directly.
 *              Otherwise the appropriate TX event is sent as an OSAL message to the MAC.
 *
 * input parameters
 *
 * @param       pMsg - Pointer message that was transmitted.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macDataTxComplete(macTx_t *pMsg)
{
  /* if data frame call callback directly; this must be done so that the application
   * can free the buffer
   */
  if (((pMsg->internal.frameType == MAC_INTERNAL_DATA) ||
       (pMsg->internal.frameType == MAC_INTERNAL_DATA_UNICAST) ||
       (pMsg->internal.frameType == MAC_INTERNAL_DATA_BROADCAST) ||
#ifndef FEATURE_WISUN_EDFE_SUPPORT
       (pMsg->internal.frameType == MAC_INTERNAL_ASYNC) ) &&
#else
      (pMsg->internal.frameType == MAC_INTERNAL_ASYNC) ||
      (pMsg->internal.frameType == MAC_INTERNAL_DATA_EDFE) ) &&
#endif
      !(pMsg->internal.txMode & MAC_TX_MODE_INTERNAL))
  {
    if(pMacPib->enDataAckPending)
    {
      if ( pMsg->hdr.status == MAC_ACK_PENDING)
      {
        /* turn off receiver */
        MAP_macRxSoftEnable(MAC_RX_POLL);
        /*set frame response timer to wait for the pending data */
        MAP_macSetEvent16(MAC_TX_DATA_REQ_TASK_EVT);
      }
      pMsg->hdr.status = MAC_SUCCESS;
    }
    MAP_macCbackForEvent((macEvent_t *) pMsg, pMsg->hdr.status);
    return;
  }
  /* no action for internal data frames */
  else if (((pMsg->internal.frameType == MAC_INTERNAL_DATA) ||
      (pMsg->internal.frameType == MAC_INTERNAL_DATA_UNICAST)) &&
          (pMsg->internal.txMode & MAC_TX_MODE_INTERNAL))
  {
    pMsg->hdr.event = MAC_NO_ACTION_EVT;
  }
  else if (pMsg->hdr.status == MAC_SUCCESS)
  {
    pMsg->hdr.event = MAC_NO_ACTION_EVT;
  }
  else
  {
    pMsg->hdr.event = MAC_NO_ACTION_EVT;
  }

  /* send event to mac */
  MAP_osal_msg_send(macTaskId, (uint8 *) pMsg);
}

/**
 * @brief This function builds and inserts header ies in the
 *        transmit buffer.
 *
 * @param pBuf           pointer to the structure containing the
 *                       transmit message buffer.
 * @param pHeaderIes     pointer to the list of header ie's that
 *                       needs to be built and inserted in the
 *                       transmit buffer.
 *
 * @return uint8         returns MAC_SUCCESS if successful.
 *                       MAC_NO_DATA if it fails to build the
 *                       requested IE.
 */
MAC_INTERNAL_API uint8
macBuildHeaderIes(macTx_t* pBuf, headerIeInfo_t *pHeaderIes )
{
  uint8 i;
  uint8 status = MAC_SUCCESS;

  MAC_PARAM_STATUS(pHeaderIes, status);
  MAC_PARAM_STATUS(pBuf, status);

  if ( MAC_SUCCESS != status )
  {
    return status;
  }

  /**
   * Start backward, with the header termination IE.
   */
  *(--pBuf->msdu.p) = MAC_HEADER_IE_TERM_SECOND_BYTE;

  if ( pBuf->internal.ptrPayloadIE )
  {
    *(--pBuf->msdu.p) = MAC_HEADER_IE_TERM_FIRST_BYTE_PAYIE;
  }
  else
  {
    *(--pBuf->msdu.p) = MAC_HEADER_IE_TERM_FIRST_BYTE_NO_PAYIE;
  }


  pBuf->msdu.len += 2;
  pBuf->internal.headerIesLen = 2;

  for (i = 0; i < MAC_HEADER_IE_MAX; i++ )
  {
    if ( MAC_HEADER_IE_TERM == pHeaderIes[i].elementId )
    {
      break;
    }

    /**
     * For now we have only WiSUN header IE. As and when we have
     * more IE's, build support to insert it, here.
     */

    if ( (MAC_HEADER_IE_WISUN == pHeaderIes[i].elementId) && (pHeaderIes[i].subIdBitMap) )
    {
      uint16 ieLen;

      /* Get the WiSUN Sub IE's len */
      ieLen = MAC_FH_GET_IE_LEN_FN( pHeaderIes[i].subIdBitMap );

      pBuf->msdu.p = pBuf->msdu.p - ieLen;

      //ToDo: Check to make sure we do not cross the buffer boundary.

      /* Insert the WiSUN Sub IE's */
#if !defined(FEATURE_WISUN_EDFE_SUPPORT) && !defined(FEATURE_WISUN_MIN_EDFE)
      if ( pHeaderIes[i].subIdBitMap && MAC_FH_RSL_IE )
      {
          FHIE_ieInfo_t rslVal;
          int8_t rsl8 = rxFhRsl;
          int16_t rsl16 = rsl8;
          /* adjust rssi value from -127 ~ +127 to -174 ~ +80 */
          if(rsl8 == MAC_RSSI_NOT_MEASURED)
          {
              rsl16 = MAC_RSL_NOT_MEASURED;
          }
          else if(rsl16 > MAC_RSL_MAX)
          {
              rsl16 = MAC_RSL_MAX;
          }
          /* adjust rssi value to rsl : 0 ~ +255 */
          rsl16 += MAC_RSL_THERMAL_NOISE;
          /* cast to 8 bit value */
          rsl8 = rsl16 & 0xFF;
          rslVal.rslIe.rsl = rsl8;
          if ( 0 == MAC_FH_GENERATE_IE_FN(pBuf->msdu.p, pHeaderIes[i].subIdBitMap, pBuf, &rslVal))
          {
            status = MAC_NO_DATA;
            return status;
          }
      }
      else
      {
          if ( 0 == MAC_FH_GENERATE_IE_FN(pBuf->msdu.p, pHeaderIes[i].subIdBitMap, pBuf, NULL))
          {
            status = MAC_NO_DATA;
            return status;
          }
      }
#else
      FHIE_ieInfo_new_t *pIeInfo = &macEdfeInfo.ieInfo;

      pIeInfo->fcIe.txFlowControl = 0;
      pIeInfo->fcIe.rxFlowControl = 0;
      pIeInfo->rslIe.rsl = 0;

      if ( pHeaderIes[i].subIdBitMap & MAC_FH_RSL_IE )
      {
          int8_t rsl8 = rxFhRsl;
          int16_t rsl16 = rsl8;
          /* adjust rssi value from -127 ~ +127 to -174 ~ +80 */
          if(rsl8 == MAC_RSSI_NOT_MEASURED)
          {
              rsl16 = MAC_RSL_NOT_MEASURED;
          }
          else if(rsl16 > MAC_RSL_MAX)
          {
              rsl16 = MAC_RSL_MAX;
          }
          /* adjust rssi value to rsl : 0 ~ +255 */
          rsl16 += MAC_RSL_THERMAL_NOISE;
          /* cast to 8 bit value */
          rsl8 = rsl16 & 0xFF;
          pIeInfo->rslIe.rsl = rsl8;
      }

      if ( pHeaderIes[i].subIdBitMap & MAC_FH_FC_IE )
      {
          pIeInfo->fcIe.txFlowControl = pIeInfo->txfc;
          pIeInfo->fcIe.rxFlowControl = pIeInfo->rxfc;
      }

      if ( 0 == MAC_FH_GENERATE_IE_FN(pBuf->msdu.p, pHeaderIes[i].subIdBitMap, pBuf, pIeInfo))
      {
        status = MAC_NO_DATA;
        return status;
      }
#endif
      pBuf->msdu.len += ieLen;
      pBuf->internal.headerIesLen += ieLen;
    }
  }

  pBuf->internal.ptrHeaderIE = pBuf->msdu.p;
  return status;
}

/**
 * @brief Updates the header IE pointer if header IE is present in macRx_t
 *        structure with the start position of header IE.
 *        It also updates the headerIeLen fields.
 *
 * @param pMsg pointer to the macRx_t containing the incoming decrypted message.
 * @return None
 */
uint8_t dbg_fc_ind = 0;
uint32_t dbg_fc[10] = {0};

void
macUpdateHeaderIEPtr(macRx_t *pMsg)
{
  uint8* ptr;
  uint8 ieContentLen;
  uint16  ieLen = 0;
  uint8 micLen = 0;

  MAC_ASSERT( NULL != pMsg );

#ifdef FEATURE_MAC_SECURITY
  micLen = macAuthTagLen[pMsg->sec.securityLevel];
#endif

  if ( pMsg->internal.fcf & MAC_FCF_IE_PRESENT_MASK )
  {
    ptr = (uint8 *)pMsg->msdu.p;

    if (MAC_HEADER_IE_TYPE(ptr) == MAC_HEADER_IE_TYPE_VAL )
    {
      /* header IE present, update the header ie pointer */
      pMsg->pHdrIes = ptr;
#ifdef FEATURE_WISUN_EDFE_SUPPORT
      if((*ptr == MAC_FC_IE_HDR_BYTE1) && (*(ptr+MAC_FC_IE_HDR_BYTE2_OFFSET) == MAC_FC_IE_HDR_BYTE2)
      && (*(ptr+MAC_FC_IE_HDR_SUBID_OFFSET) == MAC_FC_IE_HDR_SUBID))
      {
          if(macEdfeInfo.txFrameType)
          {
//              uint8 txfc = *(ptr+MAC_FC_IE_TXFC_OFFSET);
              uint8 rxfc = *(ptr+MAC_FC_IE_RXFC_OFFSET);
              if(!rxfc)
              {
                  macEdfeInfo.rxFrameType = MAC_FRAME_TYPE_EDFE_FFRM;
              }
              else
              {
                macEdfeInfo.rxFrameType = MAC_FRAME_TYPE_EDFE_RFRM;
              }
          }
          else
          {
            macEdfeInfo.rxFrameType = MAC_FRAME_TYPE_EDFE_IFRM;
          }
      }
#endif
#ifdef FEATURE_WISUN_MIN_EDFE
      // check for FC-IE and the content of FC-IE to confirm it is not a final frame (0,0)
      if((*ptr == MAC_FC_IE_HDR_BYTE1) && (*(ptr+MAC_FC_IE_HDR_BYTE2_OFFSET) == MAC_FC_IE_HDR_BYTE2)
            && (*(ptr+MAC_FC_IE_HDR_SUBID_OFFSET) == MAC_FC_IE_HDR_SUBID))
      {
          uint8 txfc = *(ptr+MAC_FC_IE_TXFC_OFFSET);
          uint8 rxfc = *(ptr+MAC_FC_IE_RXFC_OFFSET);
          if((txfc == 0) && (rxfc == 0))
          {
              macEdfeInfo.rxFrameType = MAC_FRAME_TYPE_EDFE_FFRM;
          }
          else
          {
#ifdef FH_HOP_DEBUG
    FH_Dbg.numEDFEFrRcvd++;
    //tr_info("Rcvd EDFE frame of length = %d with txfc = %d , rxfc = %d", pMsg->msdu.len, txfc, rxfc);
    dbg_fc_ind = dbg_fc_ind + 1;
    dbg_fc_ind = dbg_fc_ind % 10;
    dbg_fc[dbg_fc_ind] = ((pMsg->msdu.len) << 16) | (txfc << 8) | rxfc;
#endif
              //consider adding a condition to identify malformed pkt if txfc != 0 but rxfc == 0
              macEdfeInfo.rxFrameType = MAC_FRAME_TYPE_EDFE; //some valid EDFE frame which is not a FRFRM
          }
      }
#endif

      /* cycle through header ie's until we find the termination ie */
      do
      {
        ieContentLen = 0;
        if ( MAC_INTERNAL_HEADER_IE_TERM_WITH_PAYIE == MAC_HEADER_IE_ELEMENT_ID(ptr) )
        {
          /* Termination IE followed by payload ie's, set the payload IE flag */
          pMsg->payloadIePresent = 1;
          /* Update total header ie length */
          ieLen += MAC_HEADER_IE_HEADER_LEN;
          break;
        }
        else if ( MAC_INTERNAL_HEADER_IE_TERM_NO_PAYIE == MAC_HEADER_IE_ELEMENT_ID(ptr) )
        {
          /* Termination IE */
          pMsg->payloadIePresent = 0;
          /* Update total header ie length */
          ieLen += MAC_HEADER_IE_HEADER_LEN;
          break;
        }

        /* Get Header IE content len */
        ieContentLen = MAC_HEADER_IE_CONTENT_LEN(ptr);
        /* Update length and pointer */
        ieLen += MAC_HEADER_IE_HEADER_LEN + ieContentLen;
        ptr += MAC_HEADER_IE_HEADER_LEN + ieContentLen;

      } while(ieLen < pMsg->msdu.len - micLen );

      if (ieLen <= pMsg->msdu.len - micLen)
      {
        pMsg->headerIeLen = ieLen;
        /* update msdu */
        pMsg->msdu.p += ieLen;
        pMsg->msdu.len -= ieLen;
      }
      else
      { /* HIE is invalid, update IE length to zero */
        pMsg->headerIeLen = 0;
      }
    }
  }
}

