nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/**************************************************************************************************
 * @fn          macMgmtReset
 *
 * @brief       This function initializes the data structures for the mgmt module.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macMgmtReset(void)
{
    /* Action set 1 */
    macMgmtAction1[0] = MAP_macNoAction;
    macMgmtAction1[1] = MAP_macApiDataReq;
    macMgmtAction1[2] = MAP_macDataSend;
    macMgmtAction1[3] = MAP_macDataRxInd;
    macMgmtAction1[4] = MAP_macApiWSAsyncReq;
    macMgmtAction1[5] = MAP_macTxCsmaDelay;
    macMgmtAction1[6] = macTxBackoffHandler;
    macMgmtAction1[7] = macRxBackoffHandler;

  /* initialize macMgmt struct */
  macPanCoordinator = FALSE;
#ifdef FEATURE_WISUN_EDFE_SUPPORT
  macEdfeInfo.initiator = FALSE;
  macEdfeInfo.asyncPending = FALSE;
  memset(&macEdfeInfo.ieInfo, 0, sizeof(FHIE_ieInfo_new_t));
#endif
}

/**************************************************************************************************
 * @fn          macTxBackoffHandler
 *
 * @brief       This action function handles Tx backoff timer expiry.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macTxBackoffHandler(macEvent_t *pEvent)
{
  (void)pEvent;  // Intentionally unreferenced parameter

  /* Attempt to re-schedule Tx command, if necessary. Treat failure as NO_ACK */
  DBG_PRINT0(DBGSYS, "MAC Execute Backoff(Tx)");

  txComplete(MAC_NO_ACK);

  return;
}
/**************************************************************************************************
 * @fn          macRxBackoffHandler
 *
 * @brief       This action function handles Rx backoff timer expiry.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRxBackoffHandler(macEvent_t *pEvent)
{
  (void)pEvent;  // Intentionally unreferenced parameter

  /* Attempt to reschedule Rx command */
  DBG_PRINT0(DBGSYS, "MAC Execute Backoff(Rx)");

  macRxOnRequest();

  return;
}

/**************************************************************************************************
 * @fn          macBuildHeader
 *
 * @brief       This function builds the MAC header fields into buffer pBuf.  It builds the
 *              frame control, sequence number, and address fields.  If the frame is a command
 *              frame it builds the command frame identifier.  If the MAC is initialized for
 *              security macSecBuildHeader is called to build the security header.  If building
 *              the security header fails, the event and status are set in pBuf->hdr and a
 *              TX failure event for the frame is sent to the MAC.  The function returns
 *              MAC_SUCESS if successful or the failure status from macSecBuildHeader().
 *
 * input parameters
 *
 * @param       pBuf - Pointer to buffer containing tx struct.
 * @param       srcAddrMode - Source address mode.
 * @param       pDstAddr - Destination address.
 * @param       dstPanId - Destination PAN ID.
 *
 * output parameters
 *
 * None.
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8
macBuildHeader(macTx_t *pBuf, uint8 srcAddrMode, sAddr_t *pDstAddr, uint16 dstPanId, uint8 elideSeqNo)
{
  uint8   *p;
  uint16  fcf = 0;
  uint8   dstAddrMode = pDstAddr->addrMode;
  uint16  srcPanId;
  uint8   frameVersion = MAC_FRAME_VERSION_0;

#ifdef FEATURE_MAC_SECURITY
  uint8   status;
#endif /* FEATURE_MAC_SECURITY */

  if(pBuf->internal.frameType != MAC_INTERNAL_ASYNC)
  {
    MAP_osal_memcpy(&pBuf->internal.dest.dstAddr, pDstAddr, sizeof(sAddr_t));
  }

  /* initialize source PAN ID */
  if (srcAddrMode & MAC_SRC_PAN_ID_BROADCAST)
  {
    srcPanId = MAC_PAN_ID_BROADCAST;
  }
  else
  {
    srcPanId = pMacPib->panId;
  }
  srcAddrMode &= ~MAC_SRC_PAN_ID_BROADCAST;

#if defined(FEATURE_WISUN_EDFE_SUPPORT) || defined(FEATURE_WISUN_MIN_EDFE)
  if(pBuf->internal.frameType == MAC_INTERNAL_DATA_EDFE)
  {
      srcAddrMode = SADDR_MODE_NONE;
  }
#endif

  /* initialize some internal parameters */
  if (pBuf->internal.txOptions & MAC_TXOPTION_NO_CNF)
  {
    pBuf->internal.txMode = MAC_TX_MODE_INTERNAL;
  }
  else
  {
    pBuf->internal.txMode = 0;
  }

  if (pBuf->internal.txOptions & MAC_TXOPTION_INDIRECT)
  {
    pBuf->internal.txSched = MAC_TX_SCHED_INDIRECT;
  }
  else
  {
    pBuf->internal.txSched = MAC_TX_SCHED_READY;
  }

  /* setup retries */
  if (pBuf->internal.txOptions & MAC_TXOPTION_NO_RETRANS)
  {
    pBuf->internal.retries = 0;
  }
  else
  {
    pBuf->internal.retries = pMacPib->maxFrameRetries;
  }

  /* header is built in reverse order */

  /* set some frame control field bits */
  if (pBuf->internal.txOptions & MAC_TXOPTION_ACK)
  {
    fcf |= MAC_FCF_ACK_REQUEST_MASK;
  }

  /* set pending bit if requested */
  if (pBuf->internal.txOptions & MAC_TXOPTION_PEND_BIT)
  {
    fcf |= MAC_FCF_FRAME_PENDING_MASK;
  }

  /* working backwards  */
  p = pBuf->msdu.p - 1;

#ifndef FEATURE_WISUN_SUPPORT
  if (pBuf->internal.frameType > MAC_INTERNAL_ENHANCED_BEACON_REQ)
#else
  if (pBuf->internal.frameType >= MAC_INTERNAL_ENH_ACK)
#endif
  {
#ifdef FEATURE_ENHANCED_ACK
    if (pBuf->internal.frameType == MAC_INTERNAL_ENH_ACK)
    {
      fcf |= MAC_FRAME_TYPE_ACK;
    }
    else
#endif /* FEATURE_ENHANCED_ACK */
    {
      fcf |= MAC_INTERNAL_DATA;
    }
  }
  else
  {
    fcf |= pBuf->internal.frameType;
  }

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
      if (pBuf->sec.securityLevel > MAC_SEC_LEVEL_NONE)
      {
        /* PIB security is enabled, set security enabled in frame control field */
        fcf |= MAC_FCF_SEC_ENABLED_MASK;
      }

      /* If the security enabled in frame control field is enabled but security level is none */
      if ((fcf & MAC_FCF_SEC_ENABLED_MASK) && (pBuf->sec.securityLevel == MAC_SEC_LEVEL_NONE))
      {
        pBuf->hdr.status = MAC_UNSUPPORTED_SECURITY;
        /* Something else set the FCF Security Enabled subfield. */
        return (MAC_UNSUPPORTED_SECURITY);
      }

      /* Security is disabled */
      if (pMacPib->securityEnabled == FALSE)
      {
        if (pBuf->sec.securityLevel > MAC_SEC_LEVEL_NONE)
        {
          pBuf->hdr.status = MAC_UNSUPPORTED_SECURITY;
          /* Security is disabled but the security level is not 0 */
          return (MAC_UNSUPPORTED_SECURITY);
        }
      }

      /* Build auxiliary security header only if security is turned on and security level is not 0 */
      if (fcf & MAC_FCF_SEC_ENABLED_MASK)
      {
        /* Perform security processing; return status from security processing
         * This function will build security auxiliary security header and find the key.
         */
        if ((status = MAP_macOutgoingFrameSecurity(pBuf, pDstAddr, dstPanId,
                                               &(pBuf->internal.pKeyDesc)))
             != MAC_SUCCESS)
        {
          pBuf->hdr.status = status;

          MAP_macLowLevelDiags( MAC_DIAGS_TX_SEC_FAIL );

          return (status);
        }
        /* working backwards, msdu.p is pointing to security header, if any.  */
        p = pBuf->msdu.p - 1;
      }

#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif /* FEATURE_MAC_SECURITY */

  /* Obtain the Frame Version */
  if ( pBuf->internal.ptrHeaderIE || pBuf->internal.ptrPayloadIE )
  {
    fcf |= (((uint16)1 << MAC_FCF_IE_LIST_PRESENT_POS) & MAC_FCF_IE_PRESENT_MASK);

