nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
    /* force frame version to 2 if IE's are present */
    fcf |= (((uint16)1 << (MAC_FCF_FRAME_VERSION_POS + 1)) & MAC_FCF_FRAME_VERSION_MASK);
    frameVersion = MAC_FRAME_VERSION_2;
  }
  else if ( ((pMacPib->frameVersionSupport == 1)&&(pBuf->msdu.len > MAC_A_MAX_FRAME_SIZE))
           || (fcf & MAC_FCF_SEC_ENABLED_MASK) )
  {
    fcf |= ((1 << (MAC_FCF_FRAME_VERSION_POS)) & MAC_FCF_FRAME_VERSION_MASK);
    frameVersion = MAC_FRAME_VERSION_1;
  }
  else if ( pMacPib->frameVersionSupport == 2)
  {
    /* Frame version 2 */
    fcf |= ((1 << (MAC_FCF_FRAME_VERSION_POS + 1)) & MAC_FCF_FRAME_VERSION_MASK);
    frameVersion = MAC_FRAME_VERSION_1;
  }

  /*if sensor and checkLRMPhyMode, frame version should be 2 */
  if((!macPanCoordinator) && MAC_FH_ENABLED &&
      (pBuf->internal.fhFrameType == MAC_FH_FRAME_DATA))
  {
    fcf &= ~MAC_FCF_FRAME_VERSION_MASK;
    fcf |= ((1 << (MAC_FCF_FRAME_VERSION_POS + 1)) & MAC_FCF_FRAME_VERSION_MASK);
    frameVersion = MAC_FRAME_VERSION_2;
  }

  /* source address */
  fcf |= (uint16) srcAddrMode << MAC_FCF_SRC_ADDR_MODE_POS;
  if (srcAddrMode == SADDR_MODE_SHORT)
  {
    *p-- = HI_UINT16(pMacPib->shortAddress);
    *p-- = LO_UINT16(pMacPib->shortAddress);
  }
  else if (srcAddrMode == SADDR_MODE_EXT)
  {
    p -= SADDR_EXT_LEN - 1;
    MAP_sAddrExtRevCpy(p, pMacPib->extendedAddress.addr.extAddr);
    p--;
  }

  /* Pan Id Compression */
#ifdef FEATURE_WISUN_SUPPORT
    if((pBuf->internal.frameType == MAC_INTERNAL_DATA_EDFE) || (pBuf->internal.frameType == MAC_INTERNAL_EDFE_EFRM)
        || (pBuf->internal.frameType == MAC_INTERNAL_DATA_UNICAST) || (pBuf->internal.frameType == MAC_INTERNAL_ENH_ACK)
        || (pBuf->internal.fhFrameType == MAC_FH_FRAME_PAN_ADVERT_SOLICIT))
    {
        fcf |= MAC_FCF_INTRA_PAN_MASK;
    }
#endif

  /* source PAN ID */
  if(frameVersion == MAC_FRAME_VERSION_2)
  {
    if(!(fcf & MAC_FCF_INTRA_PAN_MASK) && (dstAddrMode == SADDR_MODE_NONE) && (srcAddrMode != SADDR_MODE_NONE))
    {
       *p-- = HI_UINT16(srcPanId);
       *p-- = LO_UINT16(srcPanId);
    }
  }
  else
  {
      return (MAC_UNSUPPORTED);
  }

  /* destination address */
  fcf |= (uint16) dstAddrMode << MAC_FCF_DST_ADDR_MODE_POS;
  if (dstAddrMode == SADDR_MODE_SHORT)
  {
    *p-- = HI_UINT16(pDstAddr->addr.shortAddr);
    *p-- = LO_UINT16(pDstAddr->addr.shortAddr);
  }
  else if (dstAddrMode == SADDR_MODE_EXT)
  {
    p -= SADDR_EXT_LEN - 1;
    MAP_sAddrExtRevCpy(p, pDstAddr->addr.extAddr);
    p--;
  }

  /* destination PAN ID */
  if ( (dstAddrMode != SADDR_MODE_NONE) && !(fcf & MAC_FCF_INTRA_PAN_MASK))
  {
    *p-- = HI_UINT16(dstPanId);
    *p-- = LO_UINT16(dstPanId);
  }

  /* sequence number */
  if ( elideSeqNo )
  {
    fcf |= ((1 << MAC_FCF_SEQ_NO_SUPPRESS_POS) & MAC_FCF_SEQ_NO_SUPPRESS_MASK);
  }
  else
  {
#ifdef FEATURE_ENHANCED_ACK
    if (pBuf->internal.frameType == MAC_INTERNAL_ENH_ACK)
    {
      *p-- = MAP_macRxSequenceNum();
    }
    else
#endif /* FEATURE_ENHANCED_ACK */
    {
      /* ehanced beacon frame use ebsn, beacon frame use bsn, or else use dsn */
      *p-- = (pBuf->internal.frameType != MAC_INTERNAL_BEACON) ? pMacPib->dsn++ :
        pBuf->internal.ptrHeaderIE ? pMacPib->ebsn++ : pMacPib->bsn++;
    }
  }

  /* frame control field */
  *p-- = HI_UINT16(fcf);
  *p   = LO_UINT16(fcf);

  /* increment length by size of header */
#ifndef MAC_PROTOCOL_TEST
  pBuf->msdu.len += (uint8) (pBuf->msdu.p - p);
  pBuf->msdu.p = p;
#endif

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif

      if (fcf & MAC_FCF_SEC_ENABLED_MASK)
      {
        if (pBuf->internal.ptrPayloadIE != NULL)
        {
          pBuf->internal.ptrMData = pBuf->internal.ptrPayloadIE;
        }
#if !defined(FEATURE_WISUN_EDFE_SUPPORT) && !defined(FEATURE_WISUN_MIN_EDFE)
        if ((!MAC_FH_ENABLED) || ((pBuf->internal.frameType == MAC_INTERNAL_ENH_ACK)))
#else
        if ((!MAC_FH_ENABLED) || ((pBuf->internal.frameType == MAC_INTERNAL_ENH_ACK)
         || (pBuf->internal.frameType == MAC_INTERNAL_EDFE_EFRM)))
#endif
        {
          /* If security is enabled but FH is not enabled,
           * encrypt and authenticate the frame here just once.
           * Frames with UTIE/BTIE will be encrypted/authenticated by LMAC
           */
          MAC_ASSERT(pBuf->internal.pKeyDesc->key != NULL);

          /* Copy outgoing frame counter and increment */
          pBuf->internal.frameCntr = pBuf->internal.pKeyDesc->frameCounter++;

          if ((status = MAP_macCcmStarTransform(pBuf->internal.pKeyDesc->key,
                                            pBuf->internal.frameCntr,
                                            pBuf->sec.securityLevel,
                                            p,
                                            pBuf->msdu.len,
                                            pBuf->internal.ptrMData,
                                            pBuf->msdu.len
                                              - (pBuf->internal.ptrMData - p)))
               != MAC_SUCCESS)
          {
            pBuf->hdr.status = status;
            return (status);
          }
        }
      }
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif /* FEATURE_MAC_SECURITY */

  pBuf->hdr.status = MAC_SUCCESS;
  return MAC_SUCCESS;
}

/**************************************************************************************************
 * @fn          macBuildCommonReq
 *
 * @brief       This function builds and sends either a data request, pan ID conflict, orphan
 *              notification, beacon request, or zero length data frame.  First a buffer is allocated
 *              with macAllocTxBuffer().  If successful the TX options and frame type are set and
 *              other parameters in the macTx_t structure are initialized.  Then macBuildHeader()
 *              is called to build the header.  If successful macDataTxEnqueue() is called to
 *              queue the frame for transmission.
 *
 * input parameters
 *
 * @param       cmd - ID of command frame to send.
 * @param       srcAddrMode - Source address mode.
 * @param       pDstAddr - Destination address.
 * @param       dstPanId - Destination PAN ID.
 * @param       txOptions - TX options for this frame.
 * @param       sec - Security settings
 *
 * output parameters
 *
 * None.
 *
 * @return      MAC_SUCCESS if successful, otherwise failure status.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macBuildCommonReq(uint8 cmd, uint8 srcAddrMode, sAddr_t *pDstAddr,
                                         uint16 dstPanId, uint16 txOptions, ApiMac_sec_t *sec)
{
  macTx_t *pMsg;
  uint8   status = MAC_NO_RESOURCES;
#if defined(FEATURE_WISUN_EDFE_SUPPORT) || defined(FEATURE_WISUN_MIN_EDFE)
  uint8_t txfc = 0, rxfc = 0;
  uint32 txOffset = 0;
  uint32 defHie = 0;
  uint8 cmdType = cmd;

  if(cmd == MAC_INTERNAL_DATA_EDFE_IFRM)
  {
      txfc = macEdfeInfo.txfc;
      rxfc = macEdfeInfo.rxfc;
      cmd = MAC_INTERNAL_EDFE_EFRM;
      txOffset = macEdfeInfo.txStartTime/1000; //msec
  }
  else if(cmd == MAC_INTERNAL_DATA_EDFE_RFRM)
  {
      txfc = 0;
      rxfc = MAC_EDFE_MAX_RXFC;
      cmd = MAC_INTERNAL_EDFE_EFRM;
      defHie = MAC_FH_RSL_IE;
  }
  else if(cmd == MAC_INTERNAL_DATA_EDFE_FFRM)
  {
      txfc = 0;
      rxfc = 0;
      cmd = MAC_INTERNAL_EDFE_EFRM;
      defHie = MAC_FH_RSL_IE;
  }
  else
  {
      txfc = 0;
      rxfc = 0;
  }
#endif
  /* allocate buffer */
  if ((pMsg = MAP_macAllocTxBuffer(cmd, sec)) != NULL)
  {
    /* set parameters */
#if defined(FEATURE_WISUN_EDFE_SUPPORT) || defined(FEATURE_WISUN_MIN_EDFE)
    macEdfeInfo.ieInfo.txfc = txfc;
    macEdfeInfo.ieInfo.rxfc = rxfc;
    macEdfeInfo.ieInfo.txOffset = txOffset;
#endif
    pMsg->internal.txOptions = txOptions;
    pMsg->internal.frameType = cmd;
    /* set security */
    MAP_osal_memcpy(&pMsg->sec, sec, sizeof(ApiMac_sec_t));

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif

