nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
#if !defined(FEATURE_WISUN_EDFE_SUPPORT) && !defined(FEATURE_WISUN_MIN_EDFE)
    if ( (MAC_INTERNAL_ZERO_DATA != cmd) && (MAC_INTERNAL_ENH_ACK != cmd) )
#else
    if ( (MAC_INTERNAL_ZERO_DATA != cmd) && (MAC_INTERNAL_ENH_ACK != cmd) && (MAC_INTERNAL_EDFE_EFRM != cmd))
#endif
    {
      /* Only the private payload field(Command Contents in case of command frame)
         should be secured. */
      pMsg->internal.ptrMData = pMsg->msdu.p + 1;
    }
    else
    {
      /* This is for the zero data packets. It does not have cmd Id */
      pMsg->internal.ptrMData = pMsg->msdu.p;
    }

#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif


    /* initialize IE pointers */
    pMsg->internal.ptrHeaderIE = NULL;
    pMsg->internal.ptrPayloadIE = NULL;
#ifdef FEATURE_FREQ_HOP_MODE
#ifdef FEATURE_ENHANCED_ACK
    /* When Freq. hopping is enabled, enhanced ack is processed here */
    if( MAC_FH_ENABLED && (MAC_INTERNAL_ENH_ACK == cmd) )
    {
      pMsg->internal.fhFrameType = MAC_FH_FRAME_ACK;

      /* build the header IE's if part of the ACK */
      /* Check if ACK has another IEs other than BT-IE */
      if ( macCmdIncludeFHIe[cmd] & (MAC_FH_HEADER_IE_MASK & ~MAC_FH_BT_IE) )
      {
        pMsg->internal.headerIeInfo[0].elementId = MAC_HEADER_IE_WISUN;
        pMsg->internal.headerIeInfo[0].subIdBitMap =
          macCmdIncludeFHIe[cmd] & MAC_FH_HEADER_IE_MASK;

        if(!macPanCoordinator)
        {
            pMsg->internal.headerIeInfo[0].subIdBitMap &= ~MAC_FH_BT_IE;
        }
        MAP_macBuildHeaderIes(pMsg, pMsg->internal.headerIeInfo);
      }

      /* Prepare the ACK to be send directly in low level MAC */
      status = MAP_macBuildHeader(pMsg, srcAddrMode, pDstAddr, dstPanId, 0);
      if (status == MAC_SUCCESS)
      {
        MAP_macRadioTxEnhAckCb(pMsg);
      }
      else
      {
#ifdef ENHACK_MALLOC
        /* Message must be freed here for failed status */
        MAP_osal_msg_deallocate( (uint8*)pMsg );
#endif
      }
      return status;
    }
#endif /* FEATURE_ENHANCED_ACK */
#if defined(FEATURE_WISUN_EDFE_SUPPORT) || defined(FEATURE_WISUN_MIN_EDFE)
    /* When Freq. hopping is enabled, enhanced ack is processed here */
    if( MAC_FH_ENABLED && (MAC_INTERNAL_EDFE_EFRM == cmd) )
    {
      if(cmdType == MAC_INTERNAL_DATA_EDFE_IFRM)
      {
          srcAddrMode = SADDR_MODE_EXT;
      }
      else
      {
          srcAddrMode = SADDR_MODE_NONE;
      }
      pMsg->internal.fhFrameType = MAC_FH_FRAME_DATA;

      /* build the header IE's if part of the ACK */
      /* Check if ACK has another IEs other than BT-IE */
      if ( macCmdIncludeFHIe[cmd] & (MAC_FH_HEADER_IE_MASK & ~MAC_FH_BT_IE) )
      {
        pMsg->internal.headerIeInfo[0].elementId = MAC_HEADER_IE_WISUN;
        pMsg->internal.headerIeInfo[0].subIdBitMap =
          macCmdIncludeFHIe[cmd] & MAC_FH_HEADER_IE_MASK;
        pMsg->internal.headerIeInfo[0].subIdBitMap |= defHie;

        if(!macPanCoordinator)
        {
            pMsg->internal.headerIeInfo[0].subIdBitMap &= ~MAC_FH_BT_IE;
        }
        MAP_macBuildHeaderIes(pMsg, pMsg->internal.headerIeInfo);
      }

      /* Prepare the EDFE transaction frame to be send directly in low level MAC */
      status = MAP_macBuildHeader(pMsg, srcAddrMode, pDstAddr, dstPanId, 1);
      if (status == MAC_SUCCESS)
      {
          macRadioTxEDFEEfrmCb(pMsg);
      }
      else
      {
#ifdef ENHACK_MALLOC
        /* Message must be freed here for failed status */
        MAP_osal_msg_deallocate( (uint8*)pMsg );
#endif
      }
      return status;
    }
#endif
#endif /*FEATURE_FREQ_HOP_MODE */
    status = MAP_macBuildHeader(pMsg, srcAddrMode, pDstAddr, dstPanId, 0);
    if (status == MAC_SUCCESS)
    {
      /* queue frame for transmission */
      MAP_macDataTxEnqueue(pMsg);
    }
  }

  return status;
}

/**************************************************************************************************
 * @fn          macApiDataReq
 *
 * @brief       This function handles an API data request event.  First the parameters are checked.
 *              If any parameters are invalid it sets hdr.status to MAC_INVALID_PARAMETER
 *              and calls the MAC callback function directly.  If ok, it calls
 *              macBuildDataFrame() to build and send a data frame.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macApiDataReq(macEvent_t *pEvent)
{
  uint8   status = MAC_SUCCESS;

  /* check parameters */
  MAC_PARAM_STATUS((macMain.featureMask & MAC_FEAT_COORD_MASK) ||
                   ((pEvent->dataReq.mac.txOptions & MAC_TXOPTION_INDIRECT) == 0), status);
  MAC_PARAM_STATUS((macMain.featureMask & MAC_FEAT_GTS_MASK) ||
                   ((pEvent->dataReq.mac.txOptions & MAC_TXOPTION_GTS) == 0), status);
  MAC_PARAM_STATUS(pEvent->dataReq.msdu.len <= macCfg.macMaxFrameSize, status);

  if ((pEvent->dataReq.mac.srcAddrMode == SADDR_MODE_NONE) &&
      (pEvent->dataReq.mac.dstAddr.addrMode == SADDR_MODE_NONE))
  {
    status = MAC_INVALID_ADDRESS;
  }

  if (status == MAC_SUCCESS)
  {
    if ( MAC_FH_ENABLED )
    {
      if ( pEvent->dataReq.mac.includeFhIEs & MAC_FH_HEADER_IE_MASK )
      {
        pEvent->dataReq.internal.headerIeInfo[0].elementId = MAC_HEADER_IE_WISUN;
        pEvent->dataReq.internal.headerIeInfo[0].subIdBitMap =
          pEvent->dataReq.mac.includeFhIEs & MAC_FH_HEADER_IE_MASK;
      }

      if ((pEvent->dataReq.mac.includeFhIEs & (~MAC_FH_MPX_IE)) & MAC_FH_PAYLOAD_IE_MASK )
      {
        pEvent->dataReq.internal.payloadIeInfo[0].gId = MAC_PAYLOAD_IE_WISUN_GID;
        pEvent->dataReq.internal.payloadIeInfo[0].subId.subIdBMap =
          pEvent->dataReq.mac.includeFhIEs & MAC_FH_PAYLOAD_IE_MASK;
      }
    }

    if (status == MAC_SUCCESS)
    {
      status = MAP_macBuildDataFrame(pEvent);
    }
  }

  if (status != MAC_SUCCESS)
  {
    DBG_PRINT1(DBGSYS, "Failed Status= 0x%X", status);
    MAP_macCbackForEvent(pEvent, status);
  }
}

