nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
/**************************************************************************************************
 * @fn          MAC_McpsDataReq
 *
 * @brief       This function sends application data to the MAC for transmission in a MAC data
 *              frame.  The function sets the event to MAC_API_DATA_REQ_EVT and sends the
 *              parameters as an OSAL message to the MAC.  The message buffer containing the
 *              parameters has already been allocated by the application.
 *
 * input parameters
 *
 * @param       pData - Pointer to parameters structure.
 *
 * output parameters
 *
 * None.
 *
 * @return      MAC_SUCCESS if successful otherwise error status.
 *              MAC_NO_RESOURCES if unable to allocate memory.
 *              MAC_TRANSACTION_OVERFLOW if the tx queue has reached the limit.
 **************************************************************************************************
 */
extern uint16_t convertTxOptions(ApiMac_txOptions_t txOptions);
extern void copyApiMacAddrToMacAddr(sAddr_t *pDst, ApiMac_sAddr_t *pSrc);
uint8 MAC_McpsDataReq(ApiMac_mcpsDataReq_t* pData)
{
  macMcpsDataReq_t *pMsg;

  /* check if correct power value is selected */
  if (pData->txOptions.usePowerAndChannel == true)
  {
      if (MAP_macGetRadioTxPowerReg(pData->power) == MAC_RADIO_TX_POWER_INVALID)
      {
        return MAC_INVALID_PARAMETER;
      }
  }

  if ( MAC_FH_ENABLED )
  {
      if( (pData->dstAddr.addrMode == SADDR_MODE_NONE) || (pData->dstAddr.addrMode == SADDR_MODE_EXT) )
      {
        /* FH UT IE + FH BT IE*/
        pData->includeFhIEs |= (MAC_FH_UT_IE | MAC_FH_BT_IE);
        if(pData->includeFhIEs & MAC_FH_FC_IE)
        {
          pData->includeFhIEs |= MAC_FH_RSL_IE;
        }
      }
  }

  if (((FALSE == pData->txOptions.indirect) &&
       (macCfg.txDataMax > macData.directCount)) ||
      ((TRUE == pData->txOptions.indirect) &&
       (macCfg.txDataMax > macData.indirectCount)))
  {

#ifdef FEATURE_EDFE_TEST_MODE
        // switch to EDFE based on global variable for data packet
        if((switchToEDFE > 0) && (pData->includeFhIEs & MAC_FH_MPX_IE) && (pData->dstAddr.addrMode != SADDR_MODE_NONE))
        {
            pData->includeFhIEs |= MAC_FH_FC_IE;
            pData->srcAddrMode = ApiMac_addrType_none;
        }
#endif

    pMsg = MAP_MAC_McpsDataAlloc(pData->msdu.len, pData->sec.securityLevel,
                             pData->sec.keyIdMode,
                             pData->includeFhIEs,
                             pData->payloadIELen);
    if(pMsg != NULL)
    {
      /* Fill in the message content */
      pMsg->hdr.event = MAC_API_DATA_REQ_EVT;
      pMsg->hdr.status = MAC_SUCCESS;

      //pMsg->msdu.len = pData->msdu.len;
      MAP_osal_memcpy(pMsg->msdu.p, pData->msdu.p, pData->msdu.len);
      MAP_osal_memcpy(&(pMsg->sec), &(pData->sec), sizeof( ApiMac_sec_t));

      MAP_copyApiMacAddrToMacAddr(&(pMsg->mac.dstAddr), &(pData->dstAddr));
      pMsg->mac.dstPanId = pData->dstPanId;
      pMsg->mac.srcAddrMode = pData->srcAddrMode;
      pMsg->mac.msduHandle = pData->msduHandle;
      pMsg->mac.txOptions = MAP_convertTxOptions(pData->txOptions);

#ifdef FEATURE_EDFE_TEST_MODE
        // switch to EDFE based on global variable for data packet
        if((switchToEDFE > 0) && (pData->includeFhIEs & MAC_FH_MPX_IE) && (pData->dstAddr.addrMode != SADDR_MODE_NONE))
        {
            pMsg->mac.txOptions &= ~MAC_TXOPTION_ACK;
            pMsg->mac.txOptions |= MAC_TXOPTION_NO_RETRANS;
        }
#endif
      pMsg->mac.channel = pData->channel;
      pMsg->mac.power = pData->power;
      pMsg->internal.gpDuration = pData->gpDuration;
      pMsg->mac.payloadIELen = pData->payloadIELen;
      pMsg->mac.fhProtoDispatch = pData->fhProtoDispatch;
      pMsg->mac.includeFhIEs = pData->includeFhIEs;

      if(0 == (pMsg->mac.includeFhIEs & MAC_FH_MPX_IE)) /* non wisun case */
      {
          /* add payload termination IE if layers above MAC have sent payload IEs*/
          if ( pMsg->mac.payloadIELen && (NULL != pMsg->mac.pIEList) )
          {
              /* Fill the Payload termination IE*/
              *(--pMsg->msdu.p) = MAC_PAYLOAD_IE_TERM_SECOND_BYTE_PAYIE;
              *(--pMsg->msdu.p) = MAC_PAYLOAD_IE_TERM_FIRST_BYTE;

              /* move the msdu.p pointer appropriately and update the length field */
              pMsg->msdu.len += MAC_PAYLOAD_IE_HEADER_LEN;
           }
      }
      /* else: for wisun case no need to add pay load termination IE */


      if(pMsg->mac.payloadIELen)
      {
          /* copy the payLoadIE List from layer above MAC into the transmit buffer*/
          MAP_osal_memcpy(pMsg->mac.pIEList, pData->pIEList, pMsg->mac.payloadIELen);

          /* move the msdu.p pointer appropriately and update the length field */
          pMsg->msdu.p -= pMsg->mac.payloadIELen;
          pMsg->msdu.len += pMsg->mac.payloadIELen;

          /* update the payload ie ptr */
          pMsg->internal.ptrPayloadIE = pMsg->msdu.p;
      }

      MAP_osal_msg_send(macTaskId, (uint8 *) pMsg);

      return MAC_SUCCESS;
    }
    else
    {
      return MAC_NO_RESOURCES;
    }
  }
  else
  {
    return MAC_TRANSACTION_OVERFLOW;
  }
}

/**
 * @brief       This direct-execute function simplifies the allocation and
 *              preparation of the data buffer MAC_McpsDataReq().  The
 *              function allocates a buffer and prepares the data pointer.
 *
 * @param       len - Length of the application data.
 * @param       securityLevel - security suire used for this frame.
 * @param       keyIdMode - Key Id mode used for this frame.
 *                  Possible values are:
 *                  MAC_KEY_ID_MODE_NONE        0x00
 *                  MAC_KEY_ID_MODE_IMPLICIT    0x00
 *                  MAC_KEY_ID_MODE_1           0x01
 *                  MAC_KEY_ID_MODE_4           0x02
 *                  MAC_KEY_ID_MODE_8           0x03
 *                  Set to MAC_KEY_ID_MODE_NONE if security is
 *                  not used.
 * @param       includeFhIEs - bitmap indicating which FH IE's
 *                           need to be included.
 * @param       payloadIeLen - length of the application payload IE's if any.
 *                             This function will allocate the buffer for the
 *                             payload IE's and set the data element pIEList
 *                             of the macDataReq_t in macMcpsDataReq_t
 *                             appropriately.
 *
 * @return      Returns a pointer to the allocated buffer. If
 *              the function fails for any reason it returns
 *              NULL.
 */
macMcpsDataReq_t *MAC_McpsDataAlloc(uint16 len, uint8 securityLevel, uint8 keyIdMode,
                                    uint32 includeFhIEs, uint16 payloadIeLen)
{
  macMcpsDataReq_t *pData;
  uint16 offset;
  uint8 micLen = 0;

  /* MAC_DATA_OFFSET is assuming the worst case */
  offset = sizeof(macMcpsDataReq_t) + MAC_DATA_OFFSET;

  if (includeFhIEs)
  {
    if (MAC_FH_ENABLED && MAC_FH_GET_IE_LEN_FN)
    {
      int16 ieLen = 0;

      /* allocate space for the freq hopping ie's to be populated by MAC (strictly)*/

      /* space for FH header ie's if any */
      ieLen = MAC_FH_GET_IE_LEN_FN( includeFhIEs & MAC_FH_HEADER_IE_MASK );

      /* space for FH header Termination IE if any */

      if(includeFhIEs & MAC_FH_MPX_IE) /*Wisun Case*/
      {
          /*pay load termination IE will not be there if mpxIE is there*/
          /* but header termination IE is a must */
          ieLen += MAC_HEADER_IE_HEADER_LEN;
      }
      else /* non-Wisun Case */
      {
          /* insert code to check if header Termination IE is needed or not */
      }

