nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
      /* space for FH payload ie's if any */
      ieLen += MAC_FH_GET_IE_LEN_FN( includeFhIEs & MAC_FH_PAYLOAD_IE_MASK );

      offset += ieLen;
    }
  }

  /* if payload ies will be included allocate buffer for the termination ie's */
  /* for wisun case : strictly no need for a payload Termination IE*/
  if(0 == (includeFhIEs & MAC_FH_MPX_IE)) /*non-Wisun Case*/
  {
      /* insert code to check if payload Termination IE is needed or not */
      /* adjust payloadIeLen if need be */
      //payloadIeLen += MAC_PAYLOAD_IE_HEADER_LEN;
  }

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
      if (pMacPib->securityEnabled == TRUE && securityLevel > MAC_SEC_LEVEL_NONE)
      {
        /* Save local copy */
        micLen = macAuthTagLen[securityLevel];

        /* Add security header length as data offset.
         * Do not add MIC length as it is not part of security header.
         */
        offset += (MAC_SEC_CONTROL_FIELD_LEN + MAC_FRAME_COUNTER_LEN + macKeySourceLen[keyIdMode]);
      }

#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#else
  (void)keyIdMode;
  (void)securityLevel;
#endif /* FEATURE_MAC_SECURITY */

  /* Allocation including security header length, MIC length, and MAC_PHY_PHR_LEN.
   * Low level MAC will fill in PHR.
   */
  pData = (macMcpsDataReq_t *)
  MAP_osal_msg_allocate(MAC_PHY_PHR_LEN + len + payloadIeLen + offset + micLen);

  if (pData)
  {
    pData->msdu.len = len + micLen;
    pData->msdu.p = (uint8 *) pData + offset + payloadIeLen + MAC_PHY_PHR_LEN;

    if ( payloadIeLen )
    {
      pData->mac.pIEList = (uint8 *)pData + offset + MAC_PHY_PHR_LEN;
    }
    else
    {
      pData->mac.pIEList = NULL;
    }

    /* Initialize to zero the internal data structure */
    MAP_osal_memset(&(pData->internal), 0x0, sizeof(macTxIntData_t));

    pData->internal.totalLen = len + offset + payloadIeLen + MAC_PHY_PHR_LEN + micLen;

    /* Initialize the headerIeInfo and PayloadIeInfo */
    MAP_osal_memset( &(pData->internal.headerIeInfo), MAC_HEADER_IE_TERM,
                 sizeof(headerIeInfo_t) * MAC_HEADER_IE_MAX );
    MAP_osal_memset( &(pData->internal.payloadIeInfo), MAC_PAYLOAD_IE_TERM_GID,
                 sizeof(payloadIeInfo_t) * MAC_PAYLOAD_IE_MAX );

    return pData;
  }
  else
  {
    return NULL;
  }
}


/**************************************************************************************************
 * @fn          macCsmaDelay
 *
 * @brief       This action function handles CSMA backoff/timer expiry.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macTxCsmaDelay(macEvent_t *pEvent)
{
  (void)pEvent;  // Intentionally unreferenced parameter

  /* pMacDataTx can be NULL when preempted by EDFE.
   * In this case, pMacDataTx was stored back into
   * macData.txQueue. Just return and get the packet
   * from the queue before retry. */
  if(pMacDataTx)
  {
    MAP_txCsmaDelay(0);
  }
  return;
}

/**
 * @brief This function initializes the MAC to allow Frequency
 *        hopping operation.
 *
 * @return None
 */
void MAC_InitFH(void)
{
  fhObject.fhEnabled = FALSE;
#ifdef FEATURE_FREQ_HOP_MODE
  fhObject.pFhResetFn = MAP_FHAPI_reset;
  fhObject.pFhStartFn = MAP_FHAPI_start;
  fhObject.pFhStartBsFn = MAP_FHAPI_startBS;
  fhObject.pFhStopAsyncFn = MAP_FHAPI_stopAsync;
  fhObject.pFhSendDataFn = MAP_FHAPI_sendData;
  fhObject.pFhGetIeLenFn = MAP_FHIE_getLen;
  fhObject.pFhGenIeFn = MAP_FHIE_gen;
  fhObject.pFhParsePieFn = MAP_FHIE_parsePie;
  fhObject.pFhExtractHieFn = MAP_FHIE_extractHie;
  fhObject.pFhExtractPieFn = MAP_FHIE_extractPie;
  fhObject.pFhParseHieFn = MAP_FHIE_parseHie;
  fhObject.pFhResetPibFn =MAP_FHPIB_reset;
  fhObject.pFhSetPibFn = MAP_FHPIB_set;
  fhObject.pFhGetPibFn = MAP_FHPIB_get;
  fhObject.pFhGetPibLenFn = MAP_FHPIB_getLen;
  fhObject.pFhGetTxParamsFn = MAP_FHAPI_getTxParams;
  fhObject.pFhCompleteTxCbFn = MAP_FHAPI_completeTxCb;
  fhObject.pFhCompleteRxCbFn = MAP_FHAPI_completeRxCb;
  fhObject.pFhSetStateCbFn = MAP_FHAPI_setStateCb;
  fhObject.pFhAddDeviceCB = MAP_FHNT_AddDeviceCB;
  fhObject.pFhDelDeviceCB = MAP_FHNT_DelDeviceCB;
  fhObject.pFhGetTxChHopFn = MAP_FHAPI_getTxChHoppingFunc;
  fhObject.pFhGetRemDTFn = MAP_FHAPI_getRemDT;
  fhObject.pFhUpdateCCA = MAP_FHDATA_updateCCA;
  fhObject.pFhGetBitCount = MAP_FHAPI_getBitCount;
  fhObject.pFhBcTimerEvent = MAP_FHMGR_BCTimerEventUpd;
#endif /* FEATURE_FREQ_HOP */
} /* MAC_InitFH() */


/**
 * @brief Updates the payload IE pointer if payload IE's are present in macRx_t
 *        structure with the start position of payload IE in the buffer.
 *        It also updates the payloadIeLen fields.
 *        Call this function only if the payload IE to precess exists.
 *
 * @param pMsg pointer to the macRx_t containing the incoming decrypted message.
 * @return None
 */

void macUpdatePayloadIEPtr(macRx_t *pMsg)
{
  uint8* ptr;
  uint16 ieContentLen;
  uint16  ieLen = 0;

  MAC_ASSERT( NULL != pMsg );

  ptr = (uint8 *)pMsg->msdu.p;
  ieLen = 0;

  if (MAC_PAYLOAD_IE_TYPE(ptr) == MAC_PAYLOAD_IE_TYPE_VAL )
  {
    pMsg->mac.pPayloadIE = ptr;

    do
    {
      ieContentLen = 0;
      if ( MAC_PAYLOAD_IE_TERM_GID == MAC_PAYLOAD_IE_GROUP_ID(ptr) )
      {
        /* Termination IE found */
        ieLen += MAC_PAYLOAD_IE_HEADER_LEN;

        break;
      }

      /* Get Payload IE information */
      ieContentLen = MAC_PAYLOAD_IE_CONTENT_LEN(ptr);
      /* Update length and pointer */
      ieLen += MAC_PAYLOAD_IE_HEADER_LEN + ieContentLen;
      ptr += MAC_PAYLOAD_IE_HEADER_LEN + ieContentLen;

    } while(ieLen < pMsg->msdu.len );

    /* sanity checking */
    if (ieLen > pMsg->msdu.len)
    { /* we should drop this packet */
      pMsg->mac.payloadIeLen = 0;
    }
    else
    {
      /* update the payload ie len */
      pMsg->mac.payloadIeLen = ieLen;

      /* update msdu */
      pMsg->msdu.p += ieLen;
      pMsg->msdu.len -= ieLen;
    }
  }
}


//from mac_beacon.c
/**************************************************************************************************
 * @fn          macBeaconCheckTxTime
 *
 * @brief       This function is called from low level MAC when a frame is being transmitted
 *              with slotted CSMA or LBT.  It calculates the number of symbols remaining for
 *              a transmission to begin.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.

