nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
 * @return      The number of symbols remaining for a transmission to begin.
 **************************************************************************************************
 */
MAC_INTERNAL_API uint16 macBeaconCheckTxTime(void)
{
  int32 timeLeft;

  /* If non beacon return 0 */
  if (pMacPib->beaconOrder == MAC_BO_NON_BEACON)
  {
    return 0;
  }

  /* if inactive then no time left */
  if (macBeacon.sched == MAC_TX_SCHED_INACTIVE)
  {
    return 0;
  }

  /* if incoming superframe with batt life ext */
  if (macBeacon.battLifeExt && macBeacon.sched == MAC_TX_SCHED_INCOMING_CAP)
  {
    /* transmission must begin before end of batt life ext period */
    timeLeft = (int32) MAP_macTimerGetTime() - (int32) macBeacon.capStart -
               (pMacPib->battLifeExtPeriods * MAC_A_UNIT_BACKOFF_CCA_PERIOD);
  }
  else
  {
    /* transmission must begin and end before end of CAP */
    timeLeft = ((int32) macBeacon.capEnd - (int32) MAP_macTimerGetTime() - macData.duration -
               macBeaconMargin[pMacPib->superframeOrder]);
    timeLeft -= MAP_macRadioTxBOBoundary();
  }
  DBG_PRINTL1(DBGSYS, "macBeaconCheckTxTime(timeLeft=%li)", timeLeft);
  if (timeLeft < 0)
  {
    return 0;
  }
  else
  {
    return (uint16) MIN(timeLeft, 65535);
  }
}

/**************************************************************************************************
 * @fn          macCbackForEvent
 *
 * @brief       This function looks up the callback event for the given internal event and
 *              calls the MAC callback function.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macCbackForEvent(macEvent_t *pEvent, uint8 status)
{
#ifdef FEATURE_WISUN_SUPPORT
  macMcpsDataCnfAck_t cbackEvent;    /* use data cnf type for all events */
#else
  macMcpsDataCnf_t cbackEvent;    /* use data cnf type for all events */
#endif

  cbackEvent.hdr.event = macCbackEventTbl[pEvent->hdr.event];
  if (cbackEvent.hdr.event != 0)
  {
    /* if data cnf fill in additional fields */
    if (cbackEvent.hdr.event == MAC_MCPS_DATA_CNF)
    {
      if (status == MAC_NO_RESOURCES)
      {
        cbackEvent.pDataReq = NULL;
      }
      else
      {
        cbackEvent.pDataReq   = &(pEvent->dataReq);
        cbackEvent.msduHandle = pEvent->dataReq.mac.msduHandle;
        cbackEvent.timestamp  = pEvent->dataReq.internal.timestamp;
        cbackEvent.timestamp2 = pEvent->dataReq.internal.timestamp2;
        cbackEvent.retries = (pEvent->dataReq.internal.txOptions & MAC_TXOPTION_NO_RETRANS) ?
                             0 : pMacPib->maxFrameRetries - pEvent->dataReq.internal.retries;
        cbackEvent.mpduLinkQuality = pEvent->dataReq.internal.mpduLinkQuality;
        cbackEvent.correlation = pEvent->dataReq.internal.correlation;
        cbackEvent.rssi = pEvent->dataReq.internal.rssi;

#ifdef FEATURE_WISUN_SUPPORT
        if((pEvent->dataReq.mac.txOptions & MAC_TXOPTION_ACK) && (status == MAC_SUCCESS))
        {
            cbackEvent.pHeaderIE = pRxBuf->pHdrIes;
            cbackEvent.headerIeLen = pRxBuf->headerIeLen;
            /* commenting original piece of code for reference */
            //cbackEvent.pPayloadIE = pRxBuf->mac.pPayloadIE;
            /* for dataCnf event, when ACK was requested, pRXBuf holds an
             * enhanced ack frame and ack frame as per spec will not
             * carry any payload IEs. Hence, re-using this field to point
             * to pRxBuf, so that the same can be passed to nanostack level
             */
            cbackEvent.pPayloadIE = pRxBuf;
            cbackEvent.payloadIeLen = pRxBuf->mac.payloadIeLen;
        }
        else
        {
            cbackEvent.pHeaderIE = NULL;
            cbackEvent.headerIeLen = 0;
            cbackEvent.pPayloadIE = NULL;
            cbackEvent.payloadIeLen = 0;
        }
#endif

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
        cbackEvent.frameCntr = pEvent->dataReq.internal.frameCntr;
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif

      }
    }
    else if (cbackEvent.hdr.event == MAC_MLME_WS_ASYNC_CNF )
    {
      MAP_osal_msg_deallocate( (uint8*)pEvent );
    }

    cbackEvent.hdr.status = status;
    MAP_MAC_CbackEvent((macCbackEvent_t *) &cbackEvent);
  }
}

/**************************************************************************************************
 * @fn          macDataRxInd
 *
 * @brief       This action function is called to handle a received data indication.  It
 *              executes the MAC callback function with event MAC_MCPS_DATA_IND.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macDataRxInd(macEvent_t *pEvent)
{
  DBG_PRINT0(DBGSYS, "macDataRxInd");
  if (pEvent->dataInd.internal.fhFrameType <= MAC_FH_FRAME_PAN_CONFIG_SOLICIT )
  {
    pEvent->hdr.event = MAC_MLME_WS_ASYNC_IND;
  }
  else
  {
    pEvent->hdr.event = MAC_MCPS_DATA_IND;
  }

#ifdef FEATURE_WISUN_SUPPORT
  pEvent->dataInd.mac.pHeaderIE = pEvent->rx.pHdrIes;
  pEvent->dataInd.mac.headerIeLen = pEvent->rx.headerIeLen;
#endif


  MAP_MAC_CbackEvent((macCbackEvent_t *) pEvent);
}

/**************************************************************************************************
 * @fn          macDeviceReset
 *
 * @brief       This function initializes the data structures for the device module.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macDeviceReset(void)
{
  macDeviceAction3[0] = macApiNodeStartReq;
  macDeviceAction4[0] = macNodeStartComplete;

  macDevice.sec.securityLevel = 0;
  macDevice.dataReqMask = 0;
  macDevice.frameTimer.pFunc = MAP_macSetEvent;
  macDevice.frameTimer.parameter = MAC_FRAME_RESPONSE_TASK_EVT;
  macDevice.responseTimer.pFunc = MAP_macSetEvent;
  macDevice.responseTimer.parameter = MAC_RESPONSE_WAIT_TASK_EVT;
}

#ifdef FEATURE_WISUN_SUPPORT
/**************************************************************************************************
 * @fn          macApiStartReq
 *
 * @brief       This action function handles an API start request event.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
bool nodeStarted = false;
MAC_INTERNAL_API void macApiNodeStartReq(macEvent_t *pEvent)
{
  if(!nodeStarted)
  {
      ApiMac_mlmeStartReq_t *pStartReq = &pEvent->api.mac.startReq;

