nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_hl_patch.c
      MAP_MAC_MlmeSetReq(MAC_PHY_CURRENT_DESCRIPTOR_ID, &pStartReq->phyID);
      MAP_MAC_MlmeSetReq(MAC_CHANNEL_PAGE, &pStartReq->channelPage);

      MAP_MAC_MlmeSetReq(MAC_PAN_ID, &pStartReq->panId);
      MAP_MAC_MlmeSetReq(MAC_LOGICAL_CHANNEL, &pStartReq->logicalChannel);

      if (MAC_FH_ENABLED && MAC_FH_START_FN)
      {
        MAC_FH_START_FN();
      }
      nodeStarted = true;
  }
  /* complete the start */
  pEvent->hdr.status = MAC_SUCCESS;
  pEvent->hdr.event = MAC_INT_START_COMPLETE_EVT;
  MAP_macExecute(pEvent);
}

/**************************************************************************************************
 * @fn          macStartComplete
 *
 * @brief       This action function is called when the start procedure is complete.  The
 *              pMacStartReq buffer is deallocated.  The MAC callback is called with event
 *              MAC_MLME_START_CNF with status from the event.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macNodeStartComplete(macEvent_t *pEvent)
{
  MAP_macRxEnable(MAC_RX_WHEN_IDLE);
  pEvent->hdr.event = MAC_MLME_START_CNF;
  MAP_MAC_CbackEvent((macCbackEvent_t *) pEvent);
}
#endif

/**************************************************************************************************
 * @fn          MAC_InitDevice
 *
 * @brief       This function initializes the MAC to associate with a non
 *              beacon-enabled network.  This function would be used to
 *              initialize a device as an RFD.  If this function is used it
 *              must be called during application initialization before any
 *              other function in the data or management API is called.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void MAC_InitDevice(void)
{
  /* Initialize action set for actions specific to Device node */
#ifdef FEATURE_WISUN_SUPPORT
  macActionSet[MAC_COORD_ACTION_1] = macDeviceAction3;
  macActionSet[MAC_COORD_ACTION_2] = macDeviceAction4;
#else
  macStateTbl[MAC_STARTING_ST] = macStartingSt;
  macStateTbl[MAC_ASSOCIATING_ST] = macAssociatingSt;
  macStateTbl[MAC_POLLING_ST] = macPollingSt;
#endif

  macReset[MAC_FEAT_DEVICE] = MAP_macDeviceReset;

  /* tx frame set schedule function */
  macDataSetSched = MAP_macSetSched;
  /* tx frame check schedule function */
  macDataCheckSched = MAP_macCheckSched;

  macMain.featureMask |= MAC_FEAT_DEVICE_MASK;
}
#endif /*#if defined(TIMAC_ROM_PATCH) */
